{
	"version": "https://jsonfeed.org/version/1",
	"title": "James Koole",
	"icon": "https://micro.blog/jameskoole/avatar.jpg",
	"home_page_url": "https://www.jameskoole.com/",
	"feed_url": "https://www.jameskoole.com/feed.json",
	"items": [
		
			{
				"id": "http://jameskoole.micro.blog/2023/03/17/trying-arc-again.html",
				"title": "Trying Arc Again",
				"content_html": "<p>I&rsquo;ve been trying the Arc browser from the aptly-named The Browser Company lately. I gave it a go in February, but it just didn&rsquo;t stick for me and I opted to go with Vivaldi at that point. But Arc is quite intriguing to me so this week I decided to give it another go.</p>\n<p>The difference this time around is that I&rsquo;m not trying to fight against how Arc wants to be used. It&rsquo;s a very opinionated browser and if you try to pick it up and use it like you use Chrome or Firefox, it will fight against you.</p>\n<p>The biggest difference for me is that Arc doesn&rsquo;t really have bookmarks. I&rsquo;m a big bookmarks user, so trying to replicate that in Arc the first time I tried it was a big mistake. Instead Arc relies on Spaces and Pinned Tabs. Rather than having bookmarks, Arc just has a series of pinned tabs (arranged vertically on the left sidebar).</p>\n<p>That takes some getting used to but after a time working with it that way, it begins to make more sense. Why close a tab only to reopen it later? Arc just pins your favourite sites in pinned tabs and when you click on one, it&rsquo;s right there. You can even click deeper into the site and Arc makes it easy to return that pinned tab to the original URL later.</p>\n<p>Arc also lets you organize your tabs into Spaces. You might have a &ldquo;Frequent&rdquo; Space with a series of your most used sites. Then a &ldquo;Work&rdquo; Space with the sites you use for work (say, Google Docs, Jira and Github). Another powerful feature is that you can have Profiles as well meaning that Spaces are independent of each other – you can be signed into your work Google account on one Space and your personal Google account on another. Nice.</p>\n<p>For sites that you use a lot, like your email or Mastodon, you can pin those at the very top and they stay in place across all of your Spaces. That&rsquo;s handy! A lot of Arc features are like that&hellip;handy.</p>\n<p>Arc is Chromium-based so sites work fine in the browser and all your favourite extensions for Chrome work perfectly in Arc. I tried Orion from Kagi for a bit but the lack of official support from 1Password made that a non-starter for me. Arc, on the other hand, is fully blessed in 1Password meaning TouchID is fully supported and it works just like it does in other mainstream browsers.</p>\n<h3 id=\"pros\">Pros:</h3>\n<ul>\n<li>Fast and compatible thanks to Chromium under the hood.</li>\n<li>Visually polished.</li>\n<li>Under active development with new releases often and a very open roadmap.</li>\n<li>Works with all your favourite extensions like 1Password, uBlock Origin, etc.</li>\n<li>Spaces and Profiles are powerful tools to manage different contexts like work vs. personal.</li>\n</ul>\n<h3 id=\"cons\">Cons:</h3>\n<ul>\n<li>Still in beta so you need an invite and it might be buggy now and then.</li>\n<li>Pinned tabs and UI is opinionated and requires some effort to adopt fully.</li>\n<li>Sidebar takes some getting used to.</li>\n</ul>\n<p>Would I recommend Arc? Sure. If you are looking for a different way of using a browser and are willing to invest some time and effort into adopting a different way of thinking about how a browser should work, then Arc is worth at least a look to see if it makes sense for you.</p>\n<p>That said, if you are happy with how your browser works today, then maybe the effort to switch to Arc wouldn&rsquo;t be worth your while.</p>\n",
				"content_text": "I've been trying the Arc browser from the aptly-named The Browser Company lately. I gave it a go in February, but it just didn't stick for me and I opted to go with Vivaldi at that point. But Arc is quite intriguing to me so this week I decided to give it another go.\r\n\r\nThe difference this time around is that I'm not trying to fight against how Arc wants to be used. It's a very opinionated browser and if you try to pick it up and use it like you use Chrome or Firefox, it will fight against you.\r\n\r\nThe biggest difference for me is that Arc doesn't really have bookmarks. I'm a big bookmarks user, so trying to replicate that in Arc the first time I tried it was a big mistake. Instead Arc relies on Spaces and Pinned Tabs. Rather than having bookmarks, Arc just has a series of pinned tabs (arranged vertically on the left sidebar).\r\n\r\nThat takes some getting used to but after a time working with it that way, it begins to make more sense. Why close a tab only to reopen it later? Arc just pins your favourite sites in pinned tabs and when you click on one, it's right there. You can even click deeper into the site and Arc makes it easy to return that pinned tab to the original URL later.\r\n\r\nArc also lets you organize your tabs into Spaces. You might have a \"Frequent\" Space with a series of your most used sites. Then a \"Work\" Space with the sites you use for work (say, Google Docs, Jira and Github). Another powerful feature is that you can have Profiles as well meaning that Spaces are independent of each other – you can be signed into your work Google account on one Space and your personal Google account on another. Nice.\r\n\r\nFor sites that you use a lot, like your email or Mastodon, you can pin those at the very top and they stay in place across all of your Spaces. That's handy! A lot of Arc features are like that...handy.\r\n\r\nArc is Chromium-based so sites work fine in the browser and all your favourite extensions for Chrome work perfectly in Arc. I tried Orion from Kagi for a bit but the lack of official support from 1Password made that a non-starter for me. Arc, on the other hand, is fully blessed in 1Password meaning TouchID is fully supported and it works just like it does in other mainstream browsers.\r\n\r\n### Pros:\r\n* Fast and compatible thanks to Chromium under the hood.\r\n* Visually polished.\r\n* Under active development with new releases often and a very open roadmap.\r\n* Works with all your favourite extensions like 1Password, uBlock Origin, etc.\r\n* Spaces and Profiles are powerful tools to manage different contexts like work vs. personal.\r\n\r\n### Cons:\r\n* Still in beta so you need an invite and it might be buggy now and then.\r\n* Pinned tabs and UI is opinionated and requires some effort to adopt fully.\r\n* Sidebar takes some getting used to.\r\n\r\nWould I recommend Arc? Sure. If you are looking for a different way of using a browser and are willing to invest some time and effort into adopting a different way of thinking about how a browser should work, then Arc is worth at least a look to see if it makes sense for you.\r\n\r\nThat said, if you are happy with how your browser works today, then maybe the effort to switch to Arc wouldn't be worth your while.\n",
				"date_published": "2023-03-17T20:47:09-04:00",
				"url": "https://www.jameskoole.com/2023/03/17/trying-arc-again.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/03/12/hilton-head-island.html",
				"title": "Hilton Head Island",
				"content_html": "<p>We&rsquo;re in Hilton Head Island for a week (as usual). We drove down over two days from Toronto starting on Friday morning. Both days went really well despite some snow through Pennsylvania and a bit of West Virginia.</p>\n<p>It was a perfect day yesterday and this morning although some rain and storms are apparently on the way for later today and overnight. After that though, it&rsquo;s looking like good weather through the end of the week.</p>\n<p>Here are some photos from the first couple of days.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "We're in Hilton Head Island for a week (as usual). We drove down over two days from Toronto starting on Friday morning. Both days went really well despite some snow through Pennsylvania and a bit of West Virginia.\n\nIt was a perfect day yesterday and this morning although some rain and storms are apparently on the way for later today and overnight. After that though, it's looking like good weather through the end of the week.\n\nHere are some photos from the first couple of days.\n\n<img src=\"uploads/2023/fec01f1767.jpg\" width=\"600\" height=\"450\" alt=\"\">\nThe view off our back deck. Never gets old, despite having been here a dozen times or more.\n<img src=\"uploads/2023/a93fd9faf2.jpg\" width=\"600\" height=\"450\" alt=\"\">\nYes, there are alligators here.\n<img src=\"uploads/2023/6edb743ff0.jpg\" width=\"600\" height=\"450\" alt=\"\">\nA classic Hilton Head Island road inside of a gated community. This one is Shipyard.\n<img src=\"uploads/2023/8addfb0c4a.jpg\" width=\"600\" height=\"450\" alt=\"\">\nOver at Sonesta Resort to access the beach and watch the sunrise.\n<img src=\"uploads/2023/f961142acc.jpg\" width=\"600\" height=\"450\" alt=\"\">\nThe sun came up as usual.\n<img src=\"uploads/2023/2802222b6a.jpg\" width=\"600\" height=\"450\" alt=\"\">\nThe road near our place, taken at the start of my run.\n<img src=\"uploads/2023/668c878ca7.jpg\" width=\"600\" height=\"449\" alt=\"\">\nMost roads have bike/walk trails on at least one side. This is in the Point Comfort neighbourhood.\n<img src=\"uploads/2023/1e7576b959.jpg\" width=\"600\" height=\"450\" alt=\"\">\nClassic low country shot with reeds in the flood prone areas next to Broad Creek.\n<img src=\"uploads/2023/b249999807.jpg\" width=\"450\" height=\"600\" alt=\"\">\nAnother lagoon in another community.\n",
				"date_published": "2023-03-12T13:45:52-04:00",
				"url": "https://www.jameskoole.com/2023/03/12/hilton-head-island.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/02/28/trainspotting.html",
				"title": "Trainspotting",
				"content_html": "<p>One of these days I&rsquo;m going to get back out to do some rail photography. It&rsquo;s always tough in the winter months because sitting trackside for hours on end isn&rsquo;t all that nice on a cold winter day. The short days and low sun make photography more difficult as well.</p>\n<p>Spring is just around the corner and the time change to daylight saving time is coming up in a couple of weeks. Here&rsquo;s hoping I can make some time to take more photos. In the meantime, I&rsquo;ve been working in some train spotting with my running.</p>\n<p>Last weekend I rode the GO Train out to Pickering and then ran back to Rouge Hill where I caught the train back to the station near our house. On the way I paralleled the tracks now and then and caught a couple of trains. I post these on my <a href=\"https://www.instagram.com/tracksidetoronto/\">Instagram account</a>, but I figured I would also put a few shots up here now and then.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "One of these days I'm going to get back out to do some rail photography. It's always tough in the winter months because sitting trackside for hours on end isn't all that nice on a cold winter day. The short days and low sun make photography more difficult as well.\n\nSpring is just around the corner and the time change to daylight saving time is coming up in a couple of weeks. Here's hoping I can make some time to take more photos. In the meantime, I've been working in some train spotting with my running.\n\nLast weekend I rode the GO Train out to Pickering and then ran back to Rouge Hill where I caught the train back to the station near our house. On the way I paralleled the tracks now and then and caught a couple of trains. I post these on my [Instagram account](https://www.instagram.com/tracksidetoronto/), but I figured I would also put a few shots up here now and then.\n\n<img src=\"uploads/2023/9c40f2a4e8.jpg\" width=\"600\" height=\"450\" alt=\"\">\n<img src=\"uploads/2023/f574a73add.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-02-28T23:18:21-04:00",
				"url": "https://www.jameskoole.com/2023/02/28/trainspotting.html",
				"tags": ["Railfanning"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/02/20/day-trips-to.html",
				"title": "Day Trips to Run",
				"content_html": "<p>We were chatting after our long Sunday run recently and the subject of travel to run or race came up. We always talk about various races and cities that we&rsquo;d like to visit to run in. This time we started thinking about the economics of just going somewhere for the day to run, vs. going for a few days to do a race.</p>\n<p>Part of this was spurred by the fact I had strongly considered taking the train to Ottawa a couple of weeks ago simply to go for a long run in a different place. The plan I had included hopping the VIA Rail train out in the morning, taking the O-Train downtown, going for a 21km run and then returning to Toronto the same way via O-Train and VIA Rail.</p>\n<p>Total cost for that trip would have been about $250 including the train tickets, transit and a meal or two somewhere along the way in Ottawa. Not bad, honestly.</p>\n<p>We started thinking about whether it would make sense to go further afield and really push things a bit more. I suggested Montreal or Quebec City, but Miguel was thinking further – Halifax. My method of transportation was generally the train, but the time spent on our not-so-fast corridor services with VIA Rail really eats into the day. Flights, on the other hand&hellip;</p>\n<p>Depending on the day, we could fly Toronto to Halifax for about $230 return. That would be about the same cost as my Ottawa trip, but quite a different experience. Flying from the downtown airport in Toronto would mean we could easily get there on transit for a couple of bucks.</p>\n<p>The Halifax side would be a bit more complicated, but if three or four of us went, splitting a cab or Uber from the airport to downtown wouldn&rsquo;t be too expensive. If we grabbed the first flight of the day, we could be in downtown Halifax by just after noon local time. A two hour run around town would have us back in time for a late lunch/early dinner somewhere and plenty of time to catch a 7:25 P.M. back to Toronto around 10:15 P.M.</p>\n<p>Total spend on a trip like that would be something like $350 per person which is far less than a marathon race weekend would cost. The key to this would be finding a cheap flight and avoiding an overnight stay. Something to think about for sure!</p>\n",
				"content_text": "We were chatting after our long Sunday run recently and the subject of travel to run or race came up. We always talk about various races and cities that we'd like to visit to run in. This time we started thinking about the economics of just going somewhere for the day to run, vs. going for a few days to do a race.\n\nPart of this was spurred by the fact I had strongly considered taking the train to Ottawa a couple of weeks ago simply to go for a long run in a different place. The plan I had included hopping the VIA Rail train out in the morning, taking the O-Train downtown, going for a 21km run and then returning to Toronto the same way via O-Train and VIA Rail.\n\nTotal cost for that trip would have been about $250 including the train tickets, transit and a meal or two somewhere along the way in Ottawa. Not bad, honestly.\n\nWe started thinking about whether it would make sense to go further afield and really push things a bit more. I suggested Montreal or Quebec City, but Miguel was thinking further – Halifax. My method of transportation was generally the train, but the time spent on our not-so-fast corridor services with VIA Rail really eats into the day. Flights, on the other hand...\n\nDepending on the day, we could fly Toronto to Halifax for about $230 return. That would be about the same cost as my Ottawa trip, but quite a different experience. Flying from the downtown airport in Toronto would mean we could easily get there on transit for a couple of bucks.\n\nThe Halifax side would be a bit more complicated, but if three or four of us went, splitting a cab or Uber from the airport to downtown wouldn't be too expensive. If we grabbed the first flight of the day, we could be in downtown Halifax by just after noon local time. A two hour run around town would have us back in time for a late lunch/early dinner somewhere and plenty of time to catch a 7:25 P.M. back to Toronto around 10:15 P.M.\n\nTotal spend on a trip like that would be something like $350 per person which is far less than a marathon race weekend would cost. The key to this would be finding a cheap flight and avoiding an overnight stay. Something to think about for sure!\n",
				"date_published": "2023-02-20T09:54:34-04:00",
				"url": "https://www.jameskoole.com/2023/02/20/day-trips-to.html",
				"tags": ["Running"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/02/09/switching-instances.html",
				"title": "Switching Instances",
				"content_html": "<p>I started out on mastodon.social](<a href=\"https://mastodon.social\">https://mastodon.social</a>) back in 2018 and sometime after that, deleted my account. I re-created it in March, 2022 when the drama with Elon and Twitter started. When I quit Twitter late in the fall, I decided to move to a smaller instance for a variety of reasons.</p>\n<p>That instance was <a href=\"https://indieweb.social\">indieweb.social</a> and I opted for that instance because I liked the community there which seemed aligned with my thoughts on the open web. The local feed was one of the best parts of being on that instance for first little while. It was not exclusively about open/indieweb topics, but it sure leaned that way.</p>\n<p>But as the instance grew, the indieweb part seemed to fade quite a bit. And I wasn&rsquo;t helping either. My posts tended to be more about running than indieweb stuff which left me wondering if I belonged there. The value of the local feed was diminishing a bit for me and I started considering a move either to a new instance or back to mastodon.social.</p>\n<p>I thought about going to <a href=\"https://mstdn.ca\">mstdn.ca</a> (the &ldquo;Canadian&rdquo; instance) and also about going to the corporate instance my employer runs. But the more I thought about it, the more sense it made to head to <a href=\"https://mastodon.social\">mastodon.social</a>.</p>\n<p>Earlier today I <a href=\"https://mastodon.social/@jameskoole\">made the switch back</a> with the migration tool and redirect feature that Mastodon offers. It all worked pretty nicely, although I had to manually recreate some filters. My old profile on indieweb.social is redirecting and I set it to delete posts over 6 months old so by the summer it&rsquo;ll be blank and I can probably just delete it.</p>\n<p>The news that <a href=\"https://mastodon.lol/@nathan/109836633022272265\">mastodon.lol was being shut down</a> in three months was the thing that pushed me to make the move today. I didn&rsquo;t want to be worried that the folks at indieweb.social would one day decide they no longer wanted to host an instance. It&rsquo;s the same reason I wouldn&rsquo;t use the instance that the company I work for set up. I&rsquo;m  not convinced it&rsquo;ll be there for the long haul.</p>\n<p>Is that a downside to the fediverse? Yep. But, given what&rsquo;s happening to Twitter these days (and what happened to MySpace and Google+, etc.), that&rsquo;s not a concern unique to the fediverse. It&rsquo;s a downside to relying on others to host your content online.</p>\n<p>I gave a small bit of thought to either paying <a href=\"https://masto.host\">masto.host</a> for the smallest instance or running my own, on my own domain. The more I thought about it, the more I realized that I could probably count less on myself to run the instance than I could on Mastodon to keep mastodon.social running for the next few years.</p>\n",
				"content_text": "I started out on mastodon.social](https://mastodon.social) back in 2018 and sometime after that, deleted my account. I re-created it in March, 2022 when the drama with Elon and Twitter started. When I quit Twitter late in the fall, I decided to move to a smaller instance for a variety of reasons.\n\nThat instance was [indieweb.social](https://indieweb.social) and I opted for that instance because I liked the community there which seemed aligned with my thoughts on the open web. The local feed was one of the best parts of being on that instance for first little while. It was not exclusively about open/indieweb topics, but it sure leaned that way.\n\nBut as the instance grew, the indieweb part seemed to fade quite a bit. And I wasn't helping either. My posts tended to be more about running than indieweb stuff which left me wondering if I belonged there. The value of the local feed was diminishing a bit for me and I started considering a move either to a new instance or back to mastodon.social.\n\nI thought about going to [mstdn.ca](https://mstdn.ca) (the \"Canadian\" instance) and also about going to the corporate instance my employer runs. But the more I thought about it, the more sense it made to head to [mastodon.social](https://mastodon.social).\n\nEarlier today I [made the switch back](https://mastodon.social/@jameskoole) with the migration tool and redirect feature that Mastodon offers. It all worked pretty nicely, although I had to manually recreate some filters. My old profile on indieweb.social is redirecting and I set it to delete posts over 6 months old so by the summer it'll be blank and I can probably just delete it.\n\nThe news that [mastodon.lol was being shut down](https://mastodon.lol/@nathan/109836633022272265) in three months was the thing that pushed me to make the move today. I didn't want to be worried that the folks at indieweb.social would one day decide they no longer wanted to host an instance. It's the same reason I wouldn't use the instance that the company I work for set up. I'm  not convinced it'll be there for the long haul.\n\nIs that a downside to the fediverse? Yep. But, given what's happening to Twitter these days (and what happened to MySpace and Google+, etc.), that's not a concern unique to the fediverse. It's a downside to relying on others to host your content online.\n\nI gave a small bit of thought to either paying [masto.host](https://masto.host) for the smallest instance or running my own, on my own domain. The more I thought about it, the more I realized that I could probably count less on myself to run the instance than I could on Mastodon to keep mastodon.social running for the next few years.\n",
				"date_published": "2023-02-09T21:56:15-04:00",
				"url": "https://www.jameskoole.com/2023/02/09/switching-instances.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/02/01/how-ai-isnt.html",
				"title": "How AI Isn't Going to Change Blogging for the Better",
				"content_html": "<p>In recent years, advances in artificial intelligence (AI) technology have promised to revolutionize many aspects of our lives. However, this has not been the case in the world of blogging. In this blog post, we will discuss why AI isn&rsquo;t going to change blogging for the better.</p>\n<p>AI apps and automation are often touted as being able to revolutionize the blogging industry. However, there are still many issues with these technologies that could prevent them from having a major impact on blogging. For example, AI apps and automation can be expensive and difficult to maintain, and the quality of the results they produce can often be far from perfect.</p>\n<p>Bloggers rely on the human touch to create content that resonates with their readers. AI technologies are still far from being able to replicate this level of creativity and emotion, making them less useful for bloggers.</p>\n<p>Finally, implementing AI technologies into a blogging platform can be a difficult and time-consuming process. This is due to the complexity of the technology and the time required to properly configure and maintain the systems.</p>\n<p>In conclusion, AI is not going to revolutionize the world of blogging any time soon. AI apps and automation are still too expensive and difficult to maintain, they cannot replicate the human touch that bloggers rely on, and implementing them into a blogging platform can be difficult and time-consuming.</p>\n<p><em>You guessed it. I &ldquo;wrote&rdquo; this with Notion&rsquo;s AI tool.</em></p>\n",
				"content_text": "In recent years, advances in artificial intelligence (AI) technology have promised to revolutionize many aspects of our lives. However, this has not been the case in the world of blogging. In this blog post, we will discuss why AI isn't going to change blogging for the better.\r\n\r\nAI apps and automation are often touted as being able to revolutionize the blogging industry. However, there are still many issues with these technologies that could prevent them from having a major impact on blogging. For example, AI apps and automation can be expensive and difficult to maintain, and the quality of the results they produce can often be far from perfect.\r\n\r\nBloggers rely on the human touch to create content that resonates with their readers. AI technologies are still far from being able to replicate this level of creativity and emotion, making them less useful for bloggers.\r\n\r\nFinally, implementing AI technologies into a blogging platform can be a difficult and time-consuming process. This is due to the complexity of the technology and the time required to properly configure and maintain the systems.\r\n\r\nIn conclusion, AI is not going to revolutionize the world of blogging any time soon. AI apps and automation are still too expensive and difficult to maintain, they cannot replicate the human touch that bloggers rely on, and implementing them into a blogging platform can be difficult and time-consuming.\r\n\r\n_You guessed it. I \"wrote\" this with Notion's AI tool._\r\n",
				"date_published": "2023-02-01T10:18:16-04:00",
				"url": "https://www.jameskoole.com/2023/02/01/how-ai-isnt.html"
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/23/moved-back-to.html",
				
				"content_html": "<p>Moved back to micro.blog after some time on WordPress again. It&rsquo;s just too complex and heavyweight for an informal blog. Thanks to the wonders of open standards, XML, imports and such, the switch back was fairly painless and almost seamless.</p>\n",
				"content_text": "Moved back to micro.blog after some time on WordPress again. It's just too complex and heavyweight for an informal blog. Thanks to the wonders of open standards, XML, imports and such, the switch back was fairly painless and almost seamless.\n",
				"date_published": "2023-01-23T19:32:53-04:00",
				"url": "https://www.jameskoole.com/2023/01/23/moved-back-to.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/20/thanks-elon.html",
				"title": "Thanks Elon!",
				"content_html": "<p>I&rsquo;m not really surprised. In fact, I&rsquo;m surprised it took this long.</p>\n<p>Back when Elon bought Twitter, one of the first things I did was to start using the official iOS Twitter app. I kept <a href=\"https://tapbots.com/tweetbot/\">Tweetbot</a> on my phone, but I used Twitter instead full-time because my assumption was that at some point third-party apps were going to be banned.</p>\n<p>My use of the official Twitter app was fairly short-lived. The app sucks, to be quite frank. The algorithmic timeline is completely terrible and the injection of ads and sponsored tweets made it even worse. Even the act of composing a tweet was subpar.</p>\n<p>I had been a Tweetbot user for the better part of a decade. To me, Tweetbot was Twitter. The chronological timeline, free of ads, and consisting entirely of the tweets and retweets of the people I followed and nothing else, was the epitome of the Twitter experience.</p>\n<p>But good old Elon has decided that Tweetbot and all the rest of the third-party apps must go! Perhaps he&rsquo;s jealous of the higher quality of Tweetbot, <a href=\"https://twitterrific.com/beyond\">Twitterrific</a> and others. Whatever the case, Tweetbot is cut off at the API and dead. RIP.</p>\n<h3 id=\"enter-mastodon\">Enter Mastodon</h3>\n<p>Fortunately, I stopped using Tweetbot months ago when I deactivated my Twitter account in favour of Mastodon. I was lucky that I had started following <a href=\"http://@paul@tapbots.social\">Paul</a> and <a href=\"@mark@tapbots.social\">Mark</a> from <a href=\"https://www.tapbots.com\">Tapbots</a> on Mastodon mostly so I could stay up-to-date on the happenings with Twitter and Tweetbot.</p>\n<p>I figured the first place that I would learn about the death of third-party apps at the hand of Elon would be from the Tweetbot people. The fact they had gone to the trouble of setting up a <a href=\"https://tapbots.social\">Mastodon instance for Tapbots</a> was a very good sign that something was brewing.</p>\n<p>More fortunately, I was able to get one of the few TestFlight slots on the very first day that their new app, Ivory for Mastodon, was revealed. It felt instantly like home. It was Tweetbot-like, but still true to Mastodon - familiar, but different and not at all in an uncanny-valley way.</p>\n<p><a href=\"https://tapbots.com/ivory/\">Ivory</a> is wildly good. Along with the recent influx of the tech community into Mastodon, the existence of Ivory has made the transition from Twitter to Mastodon quite easy.</p>\n<h3 id=\"you-waited-too-long-elon\">You Waited Too Long, Elon</h3>\n<p>I shudder to think of what things would be like if Mastodon wasn&rsquo;t a thing and if new apps like Ivory weren&rsquo;t around. Quitting Twitter was made far more palatable because there was a viable alternative.</p>\n<p>Perhaps the biggest mistake that Elon made was waiting too long to kill off the third-party apps. By the time he pulled the trigger last week, we all knew Ivory was on the way and the momentum was quickly building on Mastodon.</p>\n<h3 id=\"back-in-time\">Back in Time</h3>\n<p>In many ways it feels like we&rsquo;ve been transported back in time about 10 or 12 years to when Twitter was new and the web was still a place where we all built our own sites and blogs. Mastodon has rekindled that sense in a lot of people of late. We watched as wall-gardens were built up and destroyed the indie web that we all loved.</p>\n<p>But now we have a chance to do it all over again and do it right. Mastodon is like Twitter, but built on open standards and federated. People are thinking about blogging again and bringing back their sites on their own domain names.</p>\n<p>I&rsquo;m starting to really question whether the remaining walled gardens are something I&rsquo;m willing to continue to contribute my content and attention to. I&rsquo;ve all but quit Instagram and haven&rsquo;t used Facebook in years and years. I don&rsquo;t have a TikTok and don&rsquo;t plan to get one anytime soon.</p>\n<p>Maybe the best thing to come out of Elon buying Twitter is that those of us who adopted Twitter back in the early days will be reminded of what we loved about the web back then. Will Elon kill Twitter completely? Probably not. But does it really matter anymore?</p>\n<p>He&rsquo;s already done enough to drive the nerds and internet junkies over to Mastodon. The indie devs are excitedly building apps that leverage open APIs and can&rsquo;t be shut down by one stupid childish man. It&rsquo;s the return of the internet we all knew and loved.</p>\n<p>And for that, I say &ldquo;thank you&rdquo; to Elon. You deserve none of the credit for your own ineptitude, but the internet thanks you anyway.</p>\n",
				"content_text": "I'm not really surprised. In fact, I'm surprised it took this long.\n\nBack when Elon bought Twitter, one of the first things I did was to start using the official iOS Twitter app. I kept [Tweetbot](https://tapbots.com/tweetbot/) on my phone, but I used Twitter instead full-time because my assumption was that at some point third-party apps were going to be banned.\n\nMy use of the official Twitter app was fairly short-lived. The app sucks, to be quite frank. The algorithmic timeline is completely terrible and the injection of ads and sponsored tweets made it even worse. Even the act of composing a tweet was subpar.\n\nI had been a Tweetbot user for the better part of a decade. To me, Tweetbot was Twitter. The chronological timeline, free of ads, and consisting entirely of the tweets and retweets of the people I followed and nothing else, was the epitome of the Twitter experience.\n\nBut good old Elon has decided that Tweetbot and all the rest of the third-party apps must go! Perhaps he's jealous of the higher quality of Tweetbot, [Twitterrific](https://twitterrific.com/beyond) and others. Whatever the case, Tweetbot is cut off at the API and dead. RIP.\n\n### Enter Mastodon\n\nFortunately, I stopped using Tweetbot months ago when I deactivated my Twitter account in favour of Mastodon. I was lucky that I had started following [Paul](http://@paul@tapbots.social) and [Mark](@mark@tapbots.social) from [Tapbots](https://www.tapbots.com) on Mastodon mostly so I could stay up-to-date on the happenings with Twitter and Tweetbot.\n\nI figured the first place that I would learn about the death of third-party apps at the hand of Elon would be from the Tweetbot people. The fact they had gone to the trouble of setting up a [Mastodon instance for Tapbots](https://tapbots.social) was a very good sign that something was brewing.\n\nMore fortunately, I was able to get one of the few TestFlight slots on the very first day that their new app, Ivory for Mastodon, was revealed. It felt instantly like home. It was Tweetbot-like, but still true to Mastodon - familiar, but different and not at all in an uncanny-valley way.\n\n[Ivory](https://tapbots.com/ivory/) is wildly good. Along with the recent influx of the tech community into Mastodon, the existence of Ivory has made the transition from Twitter to Mastodon quite easy.\n\n### You Waited Too Long, Elon\n\nI shudder to think of what things would be like if Mastodon wasn't a thing and if new apps like Ivory weren't around. Quitting Twitter was made far more palatable because there was a viable alternative.\n\nPerhaps the biggest mistake that Elon made was waiting too long to kill off the third-party apps. By the time he pulled the trigger last week, we all knew Ivory was on the way and the momentum was quickly building on Mastodon.\n\n### Back in Time\n\nIn many ways it feels like we've been transported back in time about 10 or 12 years to when Twitter was new and the web was still a place where we all built our own sites and blogs. Mastodon has rekindled that sense in a lot of people of late. We watched as wall-gardens were built up and destroyed the indie web that we all loved.\n\nBut now we have a chance to do it all over again and do it right. Mastodon is like Twitter, but built on open standards and federated. People are thinking about blogging again and bringing back their sites on their own domain names.\n\nI'm starting to really question whether the remaining walled gardens are something I'm willing to continue to contribute my content and attention to. I've all but quit Instagram and haven't used Facebook in years and years. I don't have a TikTok and don't plan to get one anytime soon.\n\nMaybe the best thing to come out of Elon buying Twitter is that those of us who adopted Twitter back in the early days will be reminded of what we loved about the web back then. Will Elon kill Twitter completely? Probably not. But does it really matter anymore?\n\nHe's already done enough to drive the nerds and internet junkies over to Mastodon. The indie devs are excitedly building apps that leverage open APIs and can't be shut down by one stupid childish man. It's the return of the internet we all knew and loved.\n\nAnd for that, I say \"thank you\" to Elon. You deserve none of the credit for your own ineptitude, but the internet thanks you anyway.\n",
				"date_published": "2023-01-20T22:25:57-04:00",
				"url": "https://www.jameskoole.com/2023/01/20/thanks-elon.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/14/algos-photos-and.html",
				"title": "Algos, Photos and Social",
				"content_html": "<p>It looks like Twitter (aka Elon) killed off most third-party apps the other day. That&rsquo;s not a big deal for me since I quit using Twitter a few weeks back. The goal appears to be to push all users to the Twitter iOS app and to push the algorithmic timeline over the chronological one.</p>\n<p>Over on Instagram, the same thing has happened except there aren&rsquo;t any third-party apps to kill off. The algorithmic timeline is king and that has me really considering dropping Instagram from my life as well.</p>\n<p>I have two accounts on Insta. My <a href=\"https://www.instagram.com/jameskooleto/\">personal account</a> I use to follow some friends and occasionally I&rsquo;ll follow some accounts to get me hyped up for a vacation or event. For example, I added a bunch of photographers from in and around the Canmore and Banff areas recently ahead of our trip there over the Christmas break.</p>\n<p>I have <a href=\"https://www.instagram.com/tracksidetoronto/\">another account</a> that I used to use to post my rail photography. That account has something like 750 followers but I haven&rsquo;t done much with it lately since I haven&rsquo;t been out to do much rail photography really since the start of the pandemic.</p>\n<p>The problem with Instagram is that a few years ago they decided that users should be seeing more than just the photos their friends are posting. That &ldquo;more&rdquo; includes ads, suggested posts and recently, Reels.</p>\n<p>I mostly don&rsquo;t care about the ads or Reels and Instagram is pretty bad at suggesting posts. It&rsquo;s all junk. The real issue is that Meta needs to make more money and it&rsquo;s pushing more of the crap I don&rsquo;t want at me and less of the photos that I do want to see.</p>\n<p>Opening the Instagram app now is mostly a waste of time. I might see a new photo from a friend, although it&rsquo;s more likely going to be a &ldquo;story&rdquo;. I will for sure see a crap load of suggested posts, a crap load of ads and a bunch of Reels that I don&rsquo;t care about.</p>\n<h3 id=\"what-about-pixelfed\">What About PixelFed?</h3>\n<p>Some have suggested <a href=\"https://pixelfed.org\">PixelFed</a> as the solution. I&rsquo;ve tried PixelFed but there are a few problems with it, from my perspective.</p>\n<ol>\n<li>They are trying to mimic Instagram. The app (in beta) is basically a rip-off of the Instagram UI. They also <a href=\"https://pixelfed.social\">don&rsquo;t allow browsing without an account</a> which is user-hostile and a dark pattern to get users to create an account. Gross.</li>\n<li>Nobody I know uses it. The content on PixelFed is okay, but the reason I used Instagram was to see photos from my friends. They aren&rsquo;t on PixelFed.</li>\n</ol>\n<p>I could post photos to PixelFed and try and get some friends to hop on as well. There&rsquo;s a chicken and egg thing there for sure. But is that going to be successful? I don&rsquo;t know.</p>\n<h3 id=\"how-about-mastodon\">How About Mastodon?</h3>\n<p>I could also just post my photos to Mastodon now and then and thanks to the wonders of ActivityPub and federation, I can just follow PixelFed users in Ivory or on the web version of Mastodon.</p>\n<p>Most likely I&rsquo;m going to stop bothering with Instagram and start posting more photos either directly to Mastodon or to my blog (and then linked on Mastodon). I think the single, federated account is the right way to go for me with posts that are test, photos and links.</p>\n",
				"content_text": "It looks like Twitter (aka Elon) killed off most third-party apps the other day. That's not a big deal for me since I quit using Twitter a few weeks back. The goal appears to be to push all users to the Twitter iOS app and to push the algorithmic timeline over the chronological one.\n\nOver on Instagram, the same thing has happened except there aren't any third-party apps to kill off. The algorithmic timeline is king and that has me really considering dropping Instagram from my life as well.\n\nI have two accounts on Insta. My [personal account](https://www.instagram.com/jameskooleto/) I use to follow some friends and occasionally I'll follow some accounts to get me hyped up for a vacation or event. For example, I added a bunch of photographers from in and around the Canmore and Banff areas recently ahead of our trip there over the Christmas break.\n\nI have [another account](https://www.instagram.com/tracksidetoronto/) that I used to use to post my rail photography. That account has something like 750 followers but I haven't done much with it lately since I haven't been out to do much rail photography really since the start of the pandemic.\n\nThe problem with Instagram is that a few years ago they decided that users should be seeing more than just the photos their friends are posting. That \"more\" includes ads, suggested posts and recently, Reels.\n\nI mostly don't care about the ads or Reels and Instagram is pretty bad at suggesting posts. It's all junk. The real issue is that Meta needs to make more money and it's pushing more of the crap I don't want at me and less of the photos that I do want to see.\n\nOpening the Instagram app now is mostly a waste of time. I might see a new photo from a friend, although it's more likely going to be a \"story\". I will for sure see a crap load of suggested posts, a crap load of ads and a bunch of Reels that I don't care about.\n\n### What About PixelFed?\n\nSome have suggested [PixelFed](https://pixelfed.org) as the solution. I've tried PixelFed but there are a few problems with it, from my perspective.\n\n1.  They are trying to mimic Instagram. The app (in beta) is basically a rip-off of the Instagram UI. They also [don't allow browsing without an account](https://pixelfed.social) which is user-hostile and a dark pattern to get users to create an account. Gross.\n2.  Nobody I know uses it. The content on PixelFed is okay, but the reason I used Instagram was to see photos from my friends. They aren't on PixelFed.\n\nI could post photos to PixelFed and try and get some friends to hop on as well. There's a chicken and egg thing there for sure. But is that going to be successful? I don't know.\n\n### How About Mastodon?\n\nI could also just post my photos to Mastodon now and then and thanks to the wonders of ActivityPub and federation, I can just follow PixelFed users in Ivory or on the web version of Mastodon.\n\nMost likely I'm going to stop bothering with Instagram and start posting more photos either directly to Mastodon or to my blog (and then linked on Mastodon). I think the single, federated account is the right way to go for me with posts that are test, photos and links.\n",
				"date_published": "2023-01-14T16:21:23-04:00",
				"url": "https://www.jameskoole.com/2023/01/14/algos-photos-and.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/05/day-five-in.html",
				"title": "Day Five in Canmore/Banff",
				"content_html": "<p>It was -24ºC when I woke up, -19ºC when I went for a run, and then -2ºC out in Kananaskis where we did a hike.</p>\n<p>The run featured some trails along the Bow River and a trot through downtown. Really nice views!</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/a8050175b4.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/47382fe74b.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/e4fffe5c41.jpg\" alt=\"\"></p>\n<p>After lunch at Wendy&rsquo;s we drove out to Kananaskis Country near Nakiska ski area and did the short hike up to Troll Falls. The falls were mostly frozen, but the neat thing about this one was that you could walk in behind the ice.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/35fc024b4f.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/8952510a79.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/ac844e21cd.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/f8a3632cf1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/5c6df23560.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/7845859e51.jpg\" alt=\"\"></p>\n<p>The water has carved out a cave-like area and we explored around there a bit before taking the long way back to the car across a wide meadow.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/f5ffb78770.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/1f2c7ee1bd.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/d395989c60.jpg\" alt=\"\"></p>\n<h3 id=\"scenic-drive\">Scenic Drive</h3>\n<p>We took Hwy 40 to Hwy 742 to get back to Canmore. The 742 stretch was snow-covered and a bit more of an adventure than I would have expected given the conditions on 40. Still a nice way to end the day&rsquo;s fun.</p>\n",
				"content_text": "It was -24ºC when I woke up, -19ºC when I went for a run, and then -2ºC out in Kananaskis where we did a hike.\n\nThe run featured some trails along the Bow River and a trot through downtown. Really nice views!\n\n![](https://cdn.uploads.micro.blog/65363/2023/a8050175b4.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/47382fe74b.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/e4fffe5c41.jpg)\n\nAfter lunch at Wendy's we drove out to Kananaskis Country near Nakiska ski area and did the short hike up to Troll Falls. The falls were mostly frozen, but the neat thing about this one was that you could walk in behind the ice.\n\n![](https://cdn.uploads.micro.blog/65363/2023/35fc024b4f.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/8952510a79.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/ac844e21cd.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/f8a3632cf1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/5c6df23560.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/7845859e51.jpg)\n\nThe water has carved out a cave-like area and we explored around there a bit before taking the long way back to the car across a wide meadow.\n\n![](https://cdn.uploads.micro.blog/65363/2023/f5ffb78770.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/1f2c7ee1bd.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/d395989c60.jpg)\n\n### Scenic Drive\n\nWe took Hwy 40 to Hwy 742 to get back to Canmore. The 742 stretch was snow-covered and a bit more of an adventure than I would have expected given the conditions on 40. Still a nice way to end the day's fun.\n",
				"date_published": "2023-01-05T21:35:17-04:00",
				"url": "https://www.jameskoole.com/2023/01/05/day-five-in.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/04/day-four-in.html",
				"title": "Day Four in Canmore/Banff",
				"content_html": "<p>More sunny skies and cold temperatures. But it gets milder later in the day and there&rsquo;s no wind so it&rsquo;s quite lovely. I started the day with a run again and toured the Policeman&rsquo;s Creek trail.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/e9a38a6c06.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/39daff54f1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/b4ae67a592.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/552a856afd.jpg\" alt=\"\"></p>\n<p>The blue skies were incredible this morning. Really stunning.</p>\n<h3 id=\"lake-louise\">Lake Louise</h3>\n<p>After that we drove up to Lake Louise, hoping the same sunny weather we had in Canmore would make for some glacier views. Sadly it was cloudy up there, although it&rsquo;s always beautiful no matter the weather.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/919cfabcf6.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bd611a4fe1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/56b66c0cdf.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/7087108651.jpg\" alt=\"\"></p>\n<p>On the way back to Canmore, we took the scenic route which included a quick stop at Morant&rsquo;s Curve. There was a train tied up in Lake Louise and another one at Castle Junction so perhaps there were issues on the mainline. Whatever the case, no trains to be seen at the Curve, but it&rsquo;s still a great photo spot.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/6cf1fdb956.jpg\" alt=\"\"></p>\n<p>Another great day in the mountains. Tonight it&rsquo;s going down to -17ºC so the run tomorrow morning should be the coldest of the week. With the cloud cover comes a change in temperatures and Friday is supposed to see a high of 0ºC.</p>\n",
				"content_text": "More sunny skies and cold temperatures. But it gets milder later in the day and there's no wind so it's quite lovely. I started the day with a run again and toured the Policeman's Creek trail.\n\n![](https://cdn.uploads.micro.blog/65363/2023/e9a38a6c06.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/39daff54f1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/b4ae67a592.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/552a856afd.jpg)\n\nThe blue skies were incredible this morning. Really stunning.\n\n### Lake Louise\n\nAfter that we drove up to Lake Louise, hoping the same sunny weather we had in Canmore would make for some glacier views. Sadly it was cloudy up there, although it's always beautiful no matter the weather.\n\n![](https://cdn.uploads.micro.blog/65363/2023/919cfabcf6.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/bd611a4fe1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/56b66c0cdf.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/7087108651.jpg)\n\nOn the way back to Canmore, we took the scenic route which included a quick stop at Morant's Curve. There was a train tied up in Lake Louise and another one at Castle Junction so perhaps there were issues on the mainline. Whatever the case, no trains to be seen at the Curve, but it's still a great photo spot.\n\n![](https://cdn.uploads.micro.blog/65363/2023/6cf1fdb956.jpg)\n\nAnother great day in the mountains. Tonight it's going down to -17ºC so the run tomorrow morning should be the coldest of the week. With the cloud cover comes a change in temperatures and Friday is supposed to see a high of 0ºC.\n",
				"date_published": "2023-01-04T23:16:02-04:00",
				"url": "https://www.jameskoole.com/2023/01/04/day-four-in.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/04/day-three-in.html",
				"title": "Day Three in Canmore/Banff",
				"content_html": "<p>Started out with a run (as usual). Today was colder than yesterday but still decent since the sun was coming up and the winds were still light.</p>\n<p>I ran down 3rd to the Bow River as far as the Engine Bridge, then along the Spur Line and up to the CP mainline.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bff2646b36.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bc55cba4b4.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/64a59e0a2b.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/03ab4bc2db.jpg\" alt=\"\"></p>\n<p>I stopped for coffee again (after meeting up with Ginny at the lights on the way back&hellip;a nice coincidence).</p>\n<h3 id=\"stoney-loop\">Stoney Loop</h3>\n<p>After that, Lindsey and I headed out to do a hike up Stoney Lookout near Norquay. This was a nice forested trail up to the summit of Stoney with panoramic views across the valley and up towards Canmore.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/3a4e5de402.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/1fd23e02ba.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/53ed1b7b14.jpg\" alt=\"\"></p>\n<p>It wasn&rsquo;t the toughest hike ever, but a nice way to spend an hour and a half. Lindsey enjoyed it and so did I.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/84e22281d1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/f191695a69.jpg\" alt=\"\"></p>\n<p>The way down was quite a bit steeper, ending in the parking lot at Norquay ski area.</p>\n<h3 id=\"chill-afternoon\">Chill Afternoon</h3>\n<p>After that, we chilled for a bit and then drove out to Vermillion Lakes to see Mount Rundle at sunset. There was some wild ice there that was just thin enough to avoid walking on and we discovered a warm water spring feeding into the lake.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/ac48840c28.jpg\" alt=\"\"></p>\n",
				"content_text": "Started out with a run (as usual). Today was colder than yesterday but still decent since the sun was coming up and the winds were still light.\n\nI ran down 3rd to the Bow River as far as the Engine Bridge, then along the Spur Line and up to the CP mainline.\n\n![](https://cdn.uploads.micro.blog/65363/2023/bff2646b36.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/bc55cba4b4.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/64a59e0a2b.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/03ab4bc2db.jpg)\n\nI stopped for coffee again (after meeting up with Ginny at the lights on the way back...a nice coincidence).\n\n### Stoney Loop\n\nAfter that, Lindsey and I headed out to do a hike up Stoney Lookout near Norquay. This was a nice forested trail up to the summit of Stoney with panoramic views across the valley and up towards Canmore.\n\n![](https://cdn.uploads.micro.blog/65363/2023/3a4e5de402.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/1fd23e02ba.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/53ed1b7b14.jpg)\n\nIt wasn't the toughest hike ever, but a nice way to spend an hour and a half. Lindsey enjoyed it and so did I.\n\n![](https://cdn.uploads.micro.blog/65363/2023/84e22281d1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/f191695a69.jpg)\n\nThe way down was quite a bit steeper, ending in the parking lot at Norquay ski area.\n\n### Chill Afternoon\n\nAfter that, we chilled for a bit and then drove out to Vermillion Lakes to see Mount Rundle at sunset. There was some wild ice there that was just thin enough to avoid walking on and we discovered a warm water spring feeding into the lake.\n\n![](https://cdn.uploads.micro.blog/65363/2023/ac48840c28.jpg)\n",
				"date_published": "2023-01-04T11:37:18-04:00",
				"url": "https://www.jameskoole.com/2023/01/04/day-three-in.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/02/day-two-in.html",
				"title": "Day Two in Canmore/Banff",
				"content_html": "<p>I&rsquo;m actually finding it hard to believe we only got here a few days ago.</p>\n<p>I got up a bit later and waited for dawn before I went for my run. I planned out a route that included a few streets that I haven&rsquo;t run yet and ended at Eclipse Coffee at Railway Ave. and Bow Valley Trail.</p>\n<p>It was a lot colder today compared to Sunday, but not uncomfortable. I ran down through Spring Creek and then along the river for a short time before heading up 8th (the main street).</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/9447ac6fc1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bad68d69c7.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/fe3e0987e2.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/dbd8ded251.jpg\" alt=\"\"></p>\n<p>I walked back the 500m from the coffee shop and enjoyed the views as the sun rose over the mountains and painted them in light.</p>\n<h3 id=\"johnston-canyon\">Johnston Canyon</h3>\n<p>Next up we drove to Johnston Canyon and did the hike up to the Lower Falls. We did this back in 2013 the first time we came out with the kids at Christmas.</p>\n<p>The trail to the Upper Falls was closed for maintenance, so it wasn&rsquo;t the full length, but still quite nice.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/c80c5cd7c1.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/290792be74.jpg\" alt=\"\"></p>\n<p>Pictures don&rsquo;t do it justice.</p>\n<h3 id=\"lunch-and-another-hike\">Lunch and Another Hike</h3>\n<p>After the canyon hike, we hopped back in the car and drove a bit further up the 1A to Castle Junction where we had another one of our patented car lunches of croissants with turkey and cheese.</p>\n<p>Lindsey found another hike on AllTrails that was close by so we decided to do that before we headed back. This was just about a kilometre up to the base of a waterfall and then the same distance back.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/4532c53a83.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/4f33c3d356.jpg\" alt=\"\"></p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/1dc741fe43.jpg\" alt=\"\"></p>\n<p>We didn&rsquo;t have any company on this hike (unlike the Johnston Canyon hike). It was quiet and peaceful with beautiful views across the valley.</p>\n<p>After that hike we snapped a couple of pics of Castle Mountain against a perfect, clear, blue Alberta &ldquo;big sky&rdquo; and drove back to Canmore to chill for the rest of the day.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/cde0c2dd50.jpg\" alt=\"\"></p>\n",
				"content_text": "I'm actually finding it hard to believe we only got here a few days ago.\n\nI got up a bit later and waited for dawn before I went for my run. I planned out a route that included a few streets that I haven't run yet and ended at Eclipse Coffee at Railway Ave. and Bow Valley Trail.\n\nIt was a lot colder today compared to Sunday, but not uncomfortable. I ran down through Spring Creek and then along the river for a short time before heading up 8th (the main street).\n\n![](https://cdn.uploads.micro.blog/65363/2023/9447ac6fc1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/bad68d69c7.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/fe3e0987e2.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/dbd8ded251.jpg)\n\nI walked back the 500m from the coffee shop and enjoyed the views as the sun rose over the mountains and painted them in light.\n\n### Johnston Canyon\n\nNext up we drove to Johnston Canyon and did the hike up to the Lower Falls. We did this back in 2013 the first time we came out with the kids at Christmas.\n\nThe trail to the Upper Falls was closed for maintenance, so it wasn't the full length, but still quite nice.\n\n![](https://cdn.uploads.micro.blog/65363/2023/c80c5cd7c1.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/290792be74.jpg)\n\nPictures don't do it justice.\n\n### Lunch and Another Hike\n\nAfter the canyon hike, we hopped back in the car and drove a bit further up the 1A to Castle Junction where we had another one of our patented car lunches of croissants with turkey and cheese.\n\nLindsey found another hike on AllTrails that was close by so we decided to do that before we headed back. This was just about a kilometre up to the base of a waterfall and then the same distance back.\n\n![](https://cdn.uploads.micro.blog/65363/2023/4532c53a83.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/4f33c3d356.jpg)\n\n![](https://cdn.uploads.micro.blog/65363/2023/1dc741fe43.jpg)\n\nWe didn't have any company on this hike (unlike the Johnston Canyon hike). It was quiet and peaceful with beautiful views across the valley.\n\nAfter that hike we snapped a couple of pics of Castle Mountain against a perfect, clear, blue Alberta \"big sky\" and drove back to Canmore to chill for the rest of the day.\n\n![](https://cdn.uploads.micro.blog/65363/2023/cde0c2dd50.jpg)\n",
				"date_published": "2023-01-03T00:03:11-04:00",
				"url": "https://www.jameskoole.com/2023/01/02/day-two-in.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2023/01/01/day-one-in.html",
				"title": "Day One in Canmore/Banff",
				"content_html": "<p>It&rsquo;s the first day of our mountain getaway to start 2023. We had a great and uneventful flight from Toronto to Calgary. The luggage made it and we got our rental car for the one hour drive to Canmore.</p>\n<p>I woke up at a decent time and geared up for a pre-dawn run around the town to tick off a couple more streets I&rsquo;ve never run.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/67b9aad0dc.jpg\" alt=\"\"></p>\n<p>Christmas lights along the sidewalk in Canmore.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/efaf37d378.jpg\" alt=\"\"></p>\n<p>A dark trail along Policeman&rsquo;s Creek.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bf840c694f.jpg\" alt=\"\"></p>\n<p>Spring Creek bridge at dawn.</p>\n<p>After that, we did enjoyed <a href=\"http://www.thebagel.ca\">Rocky Mountain Bagel Co.</a> bagels for breakfast (the best), and then did some groceries. Then we grabbed some <a href=\"https://eclipsecoffeeroasters.com\">Eclipse Coffee</a> flat whites and went into Banff for a bit.</p>\n<p>We accidentally left Mac&rsquo;s coat in the living room in Toronto so we needed to fix that problem first. The Bay came through with a big sale on winter jackets and we solved that before lunch without too much damage to the credit card.</p>\n<h3 id=\"bow-river-walk\">Bow River Walk</h3>\n<p>Once we had the coat sorted, we decided to walk out along the Bow River to Bow Falls and then back to the town centre. It was a beautiful day with sunny skies and mild temperatures. What a difference from last year when it was absolutely frigid.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/96ff625bcf.jpg\" alt=\"\"></p>\n<p>Bow River in Banff.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/4a9651a025.jpg\" alt=\"\"></p>\n<p>Cascade and the pedestrian bridge.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/ee0094ed3c.jpg\" alt=\"\"></p>\n<p>Rundle and Bow Falls.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/f728c9b82a.jpg\" alt=\"\"></p>\n<p>Bow Falls.</p>\n<p>We got back to the car after about 90 minutes and then made a quick lunch of croissants with turkey and cheese and some veggies and chips. Packed lunches in the car is a Banff tradition for us and we always remark that we&rsquo;ve become our parents. The last two years here with COVID, eating out was difficult and grabbing stuff to make a lunch for the car was always a great option compared to getting some takeout at a fast food place.</p>\n<h3 id=\"lake-minnewanka\">Lake Minnewanka</h3>\n<p>We drove out to Lake Minnewanka and went for a walk out on the frozen lake. There was less skating this year, but way more of the lake was frozen over. Spectacular views as usual.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/aa0110af31.jpg\" alt=\"\"></p>\n<p>Lake Minnewanka.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/401b8e423e.jpg\" alt=\"\"></p>\n<p>Lake Minnewanka.</p>\n",
				"content_text": "It's the first day of our mountain getaway to start 2023. We had a great and uneventful flight from Toronto to Calgary. The luggage made it and we got our rental car for the one hour drive to Canmore.\n\nI woke up at a decent time and geared up for a pre-dawn run around the town to tick off a couple more streets I've never run.\n\n![](https://cdn.uploads.micro.blog/65363/2023/67b9aad0dc.jpg)\n\nChristmas lights along the sidewalk in Canmore.\n\n![](https://cdn.uploads.micro.blog/65363/2023/efaf37d378.jpg)\n\nA dark trail along Policeman's Creek.\n\n![](https://cdn.uploads.micro.blog/65363/2023/bf840c694f.jpg)\n\nSpring Creek bridge at dawn.\n\nAfter that, we did enjoyed [Rocky Mountain Bagel Co.](http://www.thebagel.ca) bagels for breakfast (the best), and then did some groceries. Then we grabbed some [Eclipse Coffee](https://eclipsecoffeeroasters.com) flat whites and went into Banff for a bit.\n\nWe accidentally left Mac's coat in the living room in Toronto so we needed to fix that problem first. The Bay came through with a big sale on winter jackets and we solved that before lunch without too much damage to the credit card.\n\n### Bow River Walk\n\nOnce we had the coat sorted, we decided to walk out along the Bow River to Bow Falls and then back to the town centre. It was a beautiful day with sunny skies and mild temperatures. What a difference from last year when it was absolutely frigid.\n\n![](https://cdn.uploads.micro.blog/65363/2023/96ff625bcf.jpg)\n\nBow River in Banff.\n\n![](https://cdn.uploads.micro.blog/65363/2023/4a9651a025.jpg)\n\nCascade and the pedestrian bridge.\n\n![](https://cdn.uploads.micro.blog/65363/2023/ee0094ed3c.jpg)\n\nRundle and Bow Falls.\n\n![](https://cdn.uploads.micro.blog/65363/2023/f728c9b82a.jpg)\n\nBow Falls.\n\nWe got back to the car after about 90 minutes and then made a quick lunch of croissants with turkey and cheese and some veggies and chips. Packed lunches in the car is a Banff tradition for us and we always remark that we've become our parents. The last two years here with COVID, eating out was difficult and grabbing stuff to make a lunch for the car was always a great option compared to getting some takeout at a fast food place.\n\n### Lake Minnewanka\n\nWe drove out to Lake Minnewanka and went for a walk out on the frozen lake. There was less skating this year, but way more of the lake was frozen over. Spectacular views as usual.\n\n![](https://cdn.uploads.micro.blog/65363/2023/aa0110af31.jpg)\n\nLake Minnewanka.\n\n![](https://cdn.uploads.micro.blog/65363/2023/401b8e423e.jpg)\n\nLake Minnewanka.\n",
				"date_published": "2023-01-01T19:26:47-04:00",
				"url": "https://www.jameskoole.com/2023/01/01/day-one-in.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/12/23/an-epic-crosscanada.html",
				"title": "An Epic Cross-Canada Journey",
				"content_html": "<p>It was all supposed to be pretty easy. Our kid Lindsey (they/them), a first-year engineering student at UVic, would catch AC1902 from Victoria International Airport (YYJ) to Toronto Pearson International Airport (YYZ) on the Tuesday before Christmas to come home for a couple of weeks.</p>\n<p>A few days before that flight, we started seeing some interesting weather forecasts that called for things like 20cm of snow or worse for Victoria, BC. That seemed unlikely given Victoria&rsquo;s history with snow and so we didn&rsquo;t think a whole lot of it. Until Monday.</p>\n<p>That morning it was pretty clear that Tuesday might be a bit on the messy side and that getting to the airport would be challenging. We weren&rsquo;t even sure the flight would go if the weather turned out the way the forecasters were predicting.</p>\n<h3 id=\"the-first-hurdle\">The First Hurdle</h3>\n<p>On Tuesday morning, Lindsey woke up to 30cm of snow on the ground and a real problem. The entire transit system in Victoria was shut down along with basically every thing else in the city. Somehow AC1902 still showed as &ldquo;on time&rdquo;. It seemed inevitable that it would be cancelled.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/8e76712ab8.jpg\" alt=\"A view of a snowy UVic campus.\"></p>\n<p>Beautiful, but unwanted. Victoria is not prepared for this much snow.</p>\n<p>Taxis were impossible to find as most drivers weren&rsquo;t out on the roads. Nobody picked up the phone and ordering online just resulted in an endless wait or an immediate cancellation. I tried finding a ride on Reddit and by calling in a favour with a friend in Victoria, but neither were successful as the streets were basically impassable.</p>\n<p>By late morning it was clear that getting to YYJ wasn&rsquo;t possible. The flight now showed &ldquo;diverted&rdquo; to Calgary (YYC) first before Toronto and delayed for hours, but it wasn&rsquo;t possible to get to the Victoria airport to catch it. We got on the phone with Air Canada and I started searching for alternatives. Believe it or not, that plane eventually did make it to Toronto.</p>\n<h3 id=\"a-friday-backup\">A Friday Backup</h3>\n<p>I managed to book the same flight (AC1902) for Friday at great expense, but it seemed like our only option at this point. After nearly three hours on hold, we spoke with a very helpful Air Canada agent who cancelled our Tuesday flight and graciously swapped in our Friday flight at the same price rather than then $1,280 I had paid to book it.</p>\n<p>We thought maybe that was how it would play out. Lindsey would stick around Victoria until Friday and then fly home. But then the storm watches started popping up for Toronto starting on Thursday and through Friday and Saturday.</p>\n<h3 id=\"despair-to-hope\">Despair to Hope!</h3>\n<p>On Wednesday I talked to Lindsey on FaceTime and we talked about how tough it was there. Most of their friends had left for Christmas break on flights or ferries to the mainland and the campus was still closed and the city mostly shutdown by the snow. It was going to be a boring, depressing few days. Tears were shed.</p>\n<p>I did a bit more clicking around and working the Air Canada website, learning how flights pop in and out as people book and cancel their flights. Eventually I was able to snag a flight on Thursday morning from YYJ to Vancouver International Airport (YVR) and then a three hour layover before a flight to YYZ at 3:00 P.M.</p>\n<p>I was excited to tell Lindsey the new plan and, as expected, it was just the bit of news needed to get through the rest of that day.</p>\n<h3 id=\"looking-promising\">Looking Promising!</h3>\n<p>We thought we were home free now. Lindsey was excited to have an end date for the time on campus and it looked like the Thursday flight would be out of Vancouver well before the coming storm in Toronto that was supposed to start late Thursday and really develop on Friday morning.</p>\n<p>We had the Friday flight in our back pocket and I booked yet another ticket on Saturday&rsquo;s AC1902. Worst case, we thought, we would have Lindsey home for Christmas although the thought of being in Victoria until the weekend was not appealing and the dorms were closing on Friday afternoon meaning there was no place to live and no dining hall to get food at.</p>\n<h3 id=\"another-snowy-surprise\">Another Snowy Surprise</h3>\n<p>On Thursday there was more snow in Victoria. We tried the cab option again at 6:00 A.M. but it was clear that wasn&rsquo;t working. BC Transit was running again finally and so Lindsey trudged through the snow with a big suitcase and caught a bus from the UVic bus loop towards downtown where another bus would meet up to go up near the airport.</p>\n<p>That went decently well and Lindsey was within 1.7km of the terminal a little under two hours before the departure. Flights were leaving on time and the plane that would become the flight to Vancouver was at YVR and on-time to come over to YYJ.</p>\n<p>The bus never showed but they were able to order a cab from the airport just five minutes away that got them there in time to check in. Things were looking very hopeful! Flights were on time and the weather in Toronto was good.</p>\n<h3 id=\"its-all-gone-wrong-again\">It&rsquo;s All Gone Wrong AGAIN</h3>\n<p>Then the YYJ to YVR flight was abruptly cancelled. No flight crew was the reason. We were screwed. The only option provided for rebooking was on Christmas Day. We took it because &ldquo;why not&rdquo; and added that to the list of flights we had booked. We also learned that we were eligible for significant compensation for the cancellation of this flight because the reason was deemed to be within the control of the airline.</p>\n<h3 id=\"a-new-hope\">A New Hope!</h3>\n<p>I fired up the Air Canada website again and got to work. I fairly quickly snagged a red-eye from YVR to YYZ departing at 11:55 P.M. It wasn&rsquo;t cheap, but it was an option. We huddled up over FaceTime and decided to leave the island on the next ferry and get to YVR and hope this red-eye went.</p>\n<p>Lindsey took a cab to the ferry terminal and got a walk-on ticket for the 11:00 A.M. ferry to Tsawwassen south of Vancouver. I got on the phone with my running buddy Miguel who happened to be in Vancouver. He&rsquo;s one of the nicest people I know, a great friend, and someone who is always willing to give of himself to help others.</p>\n<p>I called in a <em>big</em> favour - could he drive an hour down from North Vancouver, pick up Lindsey at the Tsawwassen terminal and then take them to YVR? And if the flight was cancelled, could he give Lindsey a place to sleep for the night?</p>\n<p>Yes. Of course. No question.</p>\n<p>Lindsey was on the ferry now and we were committed to the Vancouver option for getting home. That move cut off our AC1902 flight options for Friday at least, and probably Saturday as well since catching those would then involve heading back to the island on the ferry.</p>\n<p>But we were willing to risk that given the greater options for flights to Toronto from YVR and the fact that we had a friend on the mainland to provide a place to stay if needed.</p>\n<h3 id=\"even-better\">Even Better!</h3>\n<p>Just as the ferry left the dock in Swartz Bay, I was able to snag yet another flight. This one was YVR to YYZ departing that evening at 5:45 P.M. Lindsey could get to YVR with the help of a pickup from Miguel and the inbound flight to YVR was already in the air and on-time. This looked very promising!</p>\n<p>The ferry was delayed a bit, but Miguel was waiting to provide the ride to YVR. Lindsey got there in plenty of time to check in, drop their big suitcase (finally) and get through the security lines. Then it was a waiting game to see if the flight actually went.</p>\n<p>We were really starting to feel hopeful at this point. The flight was on time, the weather in Toronto was holding and it wasn&rsquo;t going to be snowy and windy until Friday morning. We had the red-eye in our back pocket. I had booked yet another flight for Friday afternoon from YVR to YYZ as the final backup plan.</p>\n<p>At this point I was feeling good. We had six separate flights booked from two different airports to Toronto. Lindsey was checked into two flights on Thursday night and both were still showing as either on time or slightly delayed.</p>\n<h3 id=\"heading-home\">Heading Home</h3>\n<p>By 5:55 P.M. Vancouver time, Lindsey was on the plane. It was snowing a bit in Vancouver but it seemed like it was all going to work out. A stressful 55 minutes later, the flight finally took off heading to Toronto.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/026515f7db.jpg\" alt=\"A view out the window of an airplane with a snowy apron and baggage cart in the foreground.\"></p>\n<p>A great view.</p>\n<p>I got to work cancelling flights now. First was the red-eye, then the Friday flight from YVR to Toronto. I imagined someone like me on the Air Canada website snagging that seat or someone on standby getting a spot and rejoicing that they maybe had a new hope to get home. Then I cancelled the Saturday YYJ to YYZ flight. Lastly the Christmas Day flights were cancelled.</p>\n<p>These were all fully-refundable fares so the money was coming back to the credit card in big piles and the stress of the whole experience was finally melting away. There was one last flight in our bookings – the Friday YYJ to YYZ flight that was our original &ldquo;backup&rdquo; plan.</p>\n<h3 id=\"a-bit-of-sleep\">A Bit of Sleep</h3>\n<p>We went to bed for a few hours but set an alarm for 1:30 A.M. so my wife Ginny and older daughter Mackenzie and I could all drive out to YYZ to pick up Lindsey. The flight landed while we were driving out to the airport and we parked at Terminal 1 and went inside to the baggage area.</p>\n<p>We waited for Lindsey to de-plane which took a while because there were no ground crews to bring the plane to the gate. Finally Lindsey came through the doors from the gates area and we were able to greet them with hugs and some tears. We did it!</p>\n<p>The luggage hall was a bit of a disaster zone. There were suitcases everywhere and people standing around as well as sleeping on the few seats and on the floor. Every time a baggage carousel started up, there were cheers.</p>\n<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/bfd883b835.jpg\" alt=\"A wide angle of the baggage hall at Toronto Pearson Airport with suitcases stacked up by the dozens.\"></p>\n<p>Unclaimed suitcases everywhere.</p>\n<p>Meanwhile we got a notification from Air Canada that the Friday flight from YYJ to YYZ had been cancelled. That was the news we were hoping for as it turned our non-refundable ticket into a fully refundable one. We cancelled the last remaining flight and got the last of our money back (aside from money for the flight that Lindsey did take).</p>\n<p>At about 4:00 A.M. an announcement was made that the bags weren&rsquo;t coming and there were no baggage handlers until after 6:00 A.M.</p>\n<p>People were&hellip;unimpressed. But we just decided that we would head home and get Lindsey home to bed after a long day. We&rsquo;d go back after 6:30 A.M. and hopefully retrieve the suitcase. It&rsquo;s about a 30 minute drive each way, so we got to the house just past 4:40 A.M. and into bed before 5:00 A.M.</p>\n<p>We got about an hour more sleep before we got back up to head back to Pearson to get the suitcase with all the clothes and everything else Lindsey brought back. Ginny ran in while I looped around the terminal roads. The bag was there and we were all set.</p>\n<p>We got home at about 7:30 A.M. and the mission was fully accomplished. Lindsey was asleep in their bedroom and the suitcase was in the hallway.</p>\n<h3 id=\"an-epic-christmas-travel-story\">An Epic Christmas Travel Story</h3>\n<p>That&rsquo;s the story of what was an epic adventure to get home for Christmas around three major storms and many challenges.</p>\n<p>We were thankful that we had the financial resources to book all these flights along with the technical abilities to work the Air Canada website.</p>\n<p>We were thankful for FaceTime calls so we could speak face to face and commiserate or plan next steps and support each other through a very stressful time.</p>\n<p>I was thankful for the Apple FindMy app that let me see where Lindsey was and help navigate the BC Transit ride with live bus tracking from the Transit app.</p>\n<p>We literally couldn&rsquo;t have done it without the help of a good friend who dropped everything to lend a hand. Thank you Miguel.</p>\n<p>And lastly, we were grateful to everyone at Air Canada, BC Ferries, BC Transit, all the baggage handlers, aircraft maintenance workers, and everyone else who was working extremely hard under tough circumstances to get as many people to where they wanted to go as possible.</p>\n<p>Merry Christmas everyone.</p>\n",
				"content_text": "It was all supposed to be pretty easy. Our kid Lindsey (they/them), a first-year engineering student at UVic, would catch AC1902 from Victoria International Airport (YYJ) to Toronto Pearson International Airport (YYZ) on the Tuesday before Christmas to come home for a couple of weeks.\n\nA few days before that flight, we started seeing some interesting weather forecasts that called for things like 20cm of snow or worse for Victoria, BC. That seemed unlikely given Victoria's history with snow and so we didn't think a whole lot of it. Until Monday.\n\nThat morning it was pretty clear that Tuesday might be a bit on the messy side and that getting to the airport would be challenging. We weren't even sure the flight would go if the weather turned out the way the forecasters were predicting.\n\n### The First Hurdle\n\nOn Tuesday morning, Lindsey woke up to 30cm of snow on the ground and a real problem. The entire transit system in Victoria was shut down along with basically every thing else in the city. Somehow AC1902 still showed as \"on time\". It seemed inevitable that it would be cancelled.\n\n![A view of a snowy UVic campus.](https://cdn.uploads.micro.blog/65363/2023/8e76712ab8.jpg)\n\nBeautiful, but unwanted. Victoria is not prepared for this much snow.\n\nTaxis were impossible to find as most drivers weren't out on the roads. Nobody picked up the phone and ordering online just resulted in an endless wait or an immediate cancellation. I tried finding a ride on Reddit and by calling in a favour with a friend in Victoria, but neither were successful as the streets were basically impassable.\n\nBy late morning it was clear that getting to YYJ wasn't possible. The flight now showed \"diverted\" to Calgary (YYC) first before Toronto and delayed for hours, but it wasn't possible to get to the Victoria airport to catch it. We got on the phone with Air Canada and I started searching for alternatives. Believe it or not, that plane eventually did make it to Toronto.\n\n### A Friday Backup\n\nI managed to book the same flight (AC1902) for Friday at great expense, but it seemed like our only option at this point. After nearly three hours on hold, we spoke with a very helpful Air Canada agent who cancelled our Tuesday flight and graciously swapped in our Friday flight at the same price rather than then $1,280 I had paid to book it.\n\nWe thought maybe that was how it would play out. Lindsey would stick around Victoria until Friday and then fly home. But then the storm watches started popping up for Toronto starting on Thursday and through Friday and Saturday.\n\n### Despair to Hope!\n\nOn Wednesday I talked to Lindsey on FaceTime and we talked about how tough it was there. Most of their friends had left for Christmas break on flights or ferries to the mainland and the campus was still closed and the city mostly shutdown by the snow. It was going to be a boring, depressing few days. Tears were shed.\n\nI did a bit more clicking around and working the Air Canada website, learning how flights pop in and out as people book and cancel their flights. Eventually I was able to snag a flight on Thursday morning from YYJ to Vancouver International Airport (YVR) and then a three hour layover before a flight to YYZ at 3:00 P.M.\n\nI was excited to tell Lindsey the new plan and, as expected, it was just the bit of news needed to get through the rest of that day.\n\n### Looking Promising!\n\nWe thought we were home free now. Lindsey was excited to have an end date for the time on campus and it looked like the Thursday flight would be out of Vancouver well before the coming storm in Toronto that was supposed to start late Thursday and really develop on Friday morning.\n\nWe had the Friday flight in our back pocket and I booked yet another ticket on Saturday's AC1902. Worst case, we thought, we would have Lindsey home for Christmas although the thought of being in Victoria until the weekend was not appealing and the dorms were closing on Friday afternoon meaning there was no place to live and no dining hall to get food at.\n\n### Another Snowy Surprise\n\nOn Thursday there was more snow in Victoria. We tried the cab option again at 6:00 A.M. but it was clear that wasn't working. BC Transit was running again finally and so Lindsey trudged through the snow with a big suitcase and caught a bus from the UVic bus loop towards downtown where another bus would meet up to go up near the airport.\n\nThat went decently well and Lindsey was within 1.7km of the terminal a little under two hours before the departure. Flights were leaving on time and the plane that would become the flight to Vancouver was at YVR and on-time to come over to YYJ.\n\nThe bus never showed but they were able to order a cab from the airport just five minutes away that got them there in time to check in. Things were looking very hopeful! Flights were on time and the weather in Toronto was good.\n\n### It's All Gone Wrong AGAIN\n\nThen the YYJ to YVR flight was abruptly cancelled. No flight crew was the reason. We were screwed. The only option provided for rebooking was on Christmas Day. We took it because \"why not\" and added that to the list of flights we had booked. We also learned that we were eligible for significant compensation for the cancellation of this flight because the reason was deemed to be within the control of the airline.\n\n### A New Hope!\n\nI fired up the Air Canada website again and got to work. I fairly quickly snagged a red-eye from YVR to YYZ departing at 11:55 P.M. It wasn't cheap, but it was an option. We huddled up over FaceTime and decided to leave the island on the next ferry and get to YVR and hope this red-eye went.\n\nLindsey took a cab to the ferry terminal and got a walk-on ticket for the 11:00 A.M. ferry to Tsawwassen south of Vancouver. I got on the phone with my running buddy Miguel who happened to be in Vancouver. He's one of the nicest people I know, a great friend, and someone who is always willing to give of himself to help others.\n\nI called in a _big_ favour - could he drive an hour down from North Vancouver, pick up Lindsey at the Tsawwassen terminal and then take them to YVR? And if the flight was cancelled, could he give Lindsey a place to sleep for the night?\n\nYes. Of course. No question.\n\nLindsey was on the ferry now and we were committed to the Vancouver option for getting home. That move cut off our AC1902 flight options for Friday at least, and probably Saturday as well since catching those would then involve heading back to the island on the ferry.\n\nBut we were willing to risk that given the greater options for flights to Toronto from YVR and the fact that we had a friend on the mainland to provide a place to stay if needed.\n\n### Even Better!\n\nJust as the ferry left the dock in Swartz Bay, I was able to snag yet another flight. This one was YVR to YYZ departing that evening at 5:45 P.M. Lindsey could get to YVR with the help of a pickup from Miguel and the inbound flight to YVR was already in the air and on-time. This looked very promising!\n\nThe ferry was delayed a bit, but Miguel was waiting to provide the ride to YVR. Lindsey got there in plenty of time to check in, drop their big suitcase (finally) and get through the security lines. Then it was a waiting game to see if the flight actually went.\n\nWe were really starting to feel hopeful at this point. The flight was on time, the weather in Toronto was holding and it wasn't going to be snowy and windy until Friday morning. We had the red-eye in our back pocket. I had booked yet another flight for Friday afternoon from YVR to YYZ as the final backup plan.\n\nAt this point I was feeling good. We had six separate flights booked from two different airports to Toronto. Lindsey was checked into two flights on Thursday night and both were still showing as either on time or slightly delayed.\n\n### Heading Home\n\nBy 5:55 P.M. Vancouver time, Lindsey was on the plane. It was snowing a bit in Vancouver but it seemed like it was all going to work out. A stressful 55 minutes later, the flight finally took off heading to Toronto.\n\n![A view out the window of an airplane with a snowy apron and baggage cart in the foreground.](https://cdn.uploads.micro.blog/65363/2023/026515f7db.jpg)\n\nA great view.\n\nI got to work cancelling flights now. First was the red-eye, then the Friday flight from YVR to Toronto. I imagined someone like me on the Air Canada website snagging that seat or someone on standby getting a spot and rejoicing that they maybe had a new hope to get home. Then I cancelled the Saturday YYJ to YYZ flight. Lastly the Christmas Day flights were cancelled.\n\nThese were all fully-refundable fares so the money was coming back to the credit card in big piles and the stress of the whole experience was finally melting away. There was one last flight in our bookings – the Friday YYJ to YYZ flight that was our original \"backup\" plan.\n\n### A Bit of Sleep\n\nWe went to bed for a few hours but set an alarm for 1:30 A.M. so my wife Ginny and older daughter Mackenzie and I could all drive out to YYZ to pick up Lindsey. The flight landed while we were driving out to the airport and we parked at Terminal 1 and went inside to the baggage area.\n\nWe waited for Lindsey to de-plane which took a while because there were no ground crews to bring the plane to the gate. Finally Lindsey came through the doors from the gates area and we were able to greet them with hugs and some tears. We did it!\n\nThe luggage hall was a bit of a disaster zone. There were suitcases everywhere and people standing around as well as sleeping on the few seats and on the floor. Every time a baggage carousel started up, there were cheers.\n\n![A wide angle of the baggage hall at Toronto Pearson Airport with suitcases stacked up by the dozens.](https://cdn.uploads.micro.blog/65363/2023/bfd883b835.jpg)\n\nUnclaimed suitcases everywhere.\n\nMeanwhile we got a notification from Air Canada that the Friday flight from YYJ to YYZ had been cancelled. That was the news we were hoping for as it turned our non-refundable ticket into a fully refundable one. We cancelled the last remaining flight and got the last of our money back (aside from money for the flight that Lindsey did take).\n\nAt about 4:00 A.M. an announcement was made that the bags weren't coming and there were no baggage handlers until after 6:00 A.M.\n\nPeople were...unimpressed. But we just decided that we would head home and get Lindsey home to bed after a long day. We'd go back after 6:30 A.M. and hopefully retrieve the suitcase. It's about a 30 minute drive each way, so we got to the house just past 4:40 A.M. and into bed before 5:00 A.M.\n\nWe got about an hour more sleep before we got back up to head back to Pearson to get the suitcase with all the clothes and everything else Lindsey brought back. Ginny ran in while I looped around the terminal roads. The bag was there and we were all set.\n\nWe got home at about 7:30 A.M. and the mission was fully accomplished. Lindsey was asleep in their bedroom and the suitcase was in the hallway.\n\n### An Epic Christmas Travel Story\n\nThat's the story of what was an epic adventure to get home for Christmas around three major storms and many challenges.\n\nWe were thankful that we had the financial resources to book all these flights along with the technical abilities to work the Air Canada website.\n\nWe were thankful for FaceTime calls so we could speak face to face and commiserate or plan next steps and support each other through a very stressful time.\n\nI was thankful for the Apple FindMy app that let me see where Lindsey was and help navigate the BC Transit ride with live bus tracking from the Transit app.\n\nWe literally couldn't have done it without the help of a good friend who dropped everything to lend a hand. Thank you Miguel.\n\nAnd lastly, we were grateful to everyone at Air Canada, BC Ferries, BC Transit, all the baggage handlers, aircraft maintenance workers, and everyone else who was working extremely hard under tough circumstances to get as many people to where they wanted to go as possible.\n\nMerry Christmas everyone.\n",
				"date_published": "2022-12-23T21:19:57-04:00",
				"url": "https://www.jameskoole.com/2022/12/23/an-epic-crosscanada.html",
				"tags": ["Thoughts"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/12/20/packing-patience.html",
				"title": "Packing Patience",
				"content_html": "<p>Travel is stressful at the best of times, but when things like bad weather get thrown into the mix, it can get very overwhelming really quickly.</p>\n<p>Our kid was supposed to be flying home from Victoria, BC tonight. In fact, I should have been on the way to the airport to pick her up as I write this. Except that Victoria got 30cm of snow overnight and that basically shut the city down.</p>\n<p>The issue wasn&rsquo;t so much with the airport or the flight. It actually departed four hours late and to a different city for a stopover (Calgary) for some reason. The problem was that it was impossible to get to the airport because the transit system was shut down and there were no cabs out on the roads either.</p>\n<p>We tried this morning to arrange for a ride, to get a cab or to otherwise find a way to get to the airport, but by the original flight time, it was clear that getting to the airport was not possible.</p>\n<h3 id=\"to-the-phone\">To the Phone!</h3>\n<p>We got on the phone with Air Canada to see what the options were and needless to say, with large numbers of flights in both Victoria and Vancouver cancelled, some time was going to be spent on hold. I actually had lunch with some work friends and took the train back home before a human picked up.</p>\n<p>In the meantime, I started looking at various other flights tomorrow and beyond to see if we could spend our way out of the situation. I was watching as seats were booked and prices rose and options went from ridiculously expensive to completely unaffordable.</p>\n<p>Victoria is not a big city and the airport doesn&rsquo;t see many flights a day. There is just one non-stop to Toronto and then a bunch of flights between various cities in BC. Flights were very limited as most everything was already booked thanks to the Christmas holidays coming up. We considered whether the ferry or even a float plane to Vancouver to fly from there was an option. Since Vancouver airport was also slammed, there were few options there either.</p>\n<p>I eventually booked a very expensive flight on Friday with Air Canada (fully refundable) and hoped that the original flight would be cancelled so we could get some of our money back. Happily, we eventually got an Air Canada customer service person on the phone after well over two hours of waiting and she was able to cancel our original booking (even though the flight wasn&rsquo;t cancelled), take over the seat I had booked (and refunded us for that flight).</p>\n<h3 id=\"hashtag-winning\">Hashtag Winning</h3>\n<p>The net result of all this is that we have a flight booked for Friday morning and the change was made without charge to us. That&rsquo;s pretty decent considering the original booking was a &ldquo;basic&rdquo; fare with no refunds or changes and that flight wasn&rsquo;t cancelled.</p>\n<p>I also booked a fully refundable ticket for the Saturday flight just in case. The weather in Toronto isn&rsquo;t looking great for Thursday or Friday and the last thing we need is for the Friday flight to get cancelled and have zero options to get the kid home before Christmas.</p>\n<h3 id=\"calm-and-collected\">Calm and Collected</h3>\n<p>The biggest lesson I&rsquo;ve learned in my many years of dealing with messy situations like this is to be patient. It&rsquo;s really easy to get super frustrated and to take it out on the people who are trying to help you. If you keep a level head, it often works out far better than trying to yell your way out of a bad situation.</p>\n<p>The people at Air Canada (or WestJet or any other airline) are trying their best and really want to get you to where you are trying to go. Working with them and being flexible will often result in a good outcome. In our case, we explained our situation, said we had booked a new refundable fare on Friday and asked what our options were for the ticket we had.</p>\n<p>The customer service person was excellent and spent fifteen minutes with us on the phone moving things around, re-booking seats, cancelling check-ins and fixed us up. I&rsquo;m willing to bet that had we gone into that call demanding to fly home ASAP that we wouldn&rsquo;t have been blessed with the same outcome.</p>\n<p>Remember that the companies you deal with are made up of humans who don&rsquo;t need to be treated as anything less than a human. Things happen. Snow falls, planes break down and not everything can go as planned 100% of the time.</p>\n<p>Pack your patience and treat people the way you would want to be treated if you were the unfortunate one on the other end of the phone line and you&rsquo;ll see that things will often work out.</p>\n",
				"content_text": "Travel is stressful at the best of times, but when things like bad weather get thrown into the mix, it can get very overwhelming really quickly.\n\nOur kid was supposed to be flying home from Victoria, BC tonight. In fact, I should have been on the way to the airport to pick her up as I write this. Except that Victoria got 30cm of snow overnight and that basically shut the city down.\n\nThe issue wasn't so much with the airport or the flight. It actually departed four hours late and to a different city for a stopover (Calgary) for some reason. The problem was that it was impossible to get to the airport because the transit system was shut down and there were no cabs out on the roads either.\n\nWe tried this morning to arrange for a ride, to get a cab or to otherwise find a way to get to the airport, but by the original flight time, it was clear that getting to the airport was not possible.\n\n### To the Phone!\n\nWe got on the phone with Air Canada to see what the options were and needless to say, with large numbers of flights in both Victoria and Vancouver cancelled, some time was going to be spent on hold. I actually had lunch with some work friends and took the train back home before a human picked up.\n\nIn the meantime, I started looking at various other flights tomorrow and beyond to see if we could spend our way out of the situation. I was watching as seats were booked and prices rose and options went from ridiculously expensive to completely unaffordable.\n\nVictoria is not a big city and the airport doesn't see many flights a day. There is just one non-stop to Toronto and then a bunch of flights between various cities in BC. Flights were very limited as most everything was already booked thanks to the Christmas holidays coming up. We considered whether the ferry or even a float plane to Vancouver to fly from there was an option. Since Vancouver airport was also slammed, there were few options there either.\n\nI eventually booked a very expensive flight on Friday with Air Canada (fully refundable) and hoped that the original flight would be cancelled so we could get some of our money back. Happily, we eventually got an Air Canada customer service person on the phone after well over two hours of waiting and she was able to cancel our original booking (even though the flight wasn't cancelled), take over the seat I had booked (and refunded us for that flight).\n\n### Hashtag Winning\n\nThe net result of all this is that we have a flight booked for Friday morning and the change was made without charge to us. That's pretty decent considering the original booking was a \"basic\" fare with no refunds or changes and that flight wasn't cancelled.\n\nI also booked a fully refundable ticket for the Saturday flight just in case. The weather in Toronto isn't looking great for Thursday or Friday and the last thing we need is for the Friday flight to get cancelled and have zero options to get the kid home before Christmas.\n\n### Calm and Collected\n\nThe biggest lesson I've learned in my many years of dealing with messy situations like this is to be patient. It's really easy to get super frustrated and to take it out on the people who are trying to help you. If you keep a level head, it often works out far better than trying to yell your way out of a bad situation.\n\nThe people at Air Canada (or WestJet or any other airline) are trying their best and really want to get you to where you are trying to go. Working with them and being flexible will often result in a good outcome. In our case, we explained our situation, said we had booked a new refundable fare on Friday and asked what our options were for the ticket we had.\n\nThe customer service person was excellent and spent fifteen minutes with us on the phone moving things around, re-booking seats, cancelling check-ins and fixed us up. I'm willing to bet that had we gone into that call demanding to fly home ASAP that we wouldn't have been blessed with the same outcome.\n\nRemember that the companies you deal with are made up of humans who don't need to be treated as anything less than a human. Things happen. Snow falls, planes break down and not everything can go as planned 100% of the time.\n\nPack your patience and treat people the way you would want to be treated if you were the unfortunate one on the other end of the phone line and you'll see that things will often work out.\n",
				"date_published": "2022-12-20T20:38:26-04:00",
				"url": "https://www.jameskoole.com/2022/12/20/packing-patience.html",
				"tags": ["Travel"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/12/11/vivaldi-browser.html",
				"title": "Vivaldi Browser",
				"content_html": "<p>I was a devoted Firefox user for many years but recently, the list of annoyances with Firefox started to pile up.</p>\n<p>Some of this is self-inflicted like the Proton redesign that changed the UI for the tabs in what I thought was a step backwards. Google also started to purposefully break things on Firefox including stuff like background blur on Meet calls and fullscreen viewing in YouTube.</p>\n<p>I switched to Brave for a year or so and enjoyed that browser quite a bit. It&rsquo;s Chromium underneath meaning that it shares the open source core that Chrome is built upon. Extension support is excellent and the look and feel is nice.</p>\n<p>But Brave comes with a weird crypto play called Brave Rewards built around the Basic Attention Token (BAT) which is a cryptocurrency coin. You can disable all that stuff, but it&rsquo;s not something I think belongs in a browser.</p>\n<p>That left me looking for something new. I tried Safari but the lack of good extensions (especially for ad blocking) made that a non-starter. Orion is a new browser that looks a lot like Safari but adds Chrome/Firefox extension support. It&rsquo;s in beta and it shows &ndash; it&rsquo;s far too buggy to be an everyday browser.</p>\n<p>Microsoft offers Edge that is also built around Chromium, but like Brave, they layer on a whole load of unwanted stuff. In the case of Edge, there&rsquo;s shopping and other crapware built in that I don&rsquo;t want.</p>\n<p>What&rsquo;s left? Vivaldi.</p>\n<p>I&rsquo;ve resisted Vivaldi a bit over the years because I don&rsquo;t like the look and feel of it. I find the tabs and icons to be a bit weird looking, especially on the Mac. But I thought I would give it another go, partly because I like the direction things are going with Vivaldi but also because I learned that the UI is quite customizable.</p>\n<p>Vivaldi&rsquo;s UI is built using HTML and CSS meaning you can tweak things to your liking (to a certain extent). I&rsquo;m not doing a whole lot, but I added a bit of padding on the left side of the bookmarks bar and bumped up the font size a half a pixel to make it look just a bit better to my eye.</p>\n<p>One thing I still don&rsquo;t like is that the tabs in Vivaldi are a touch narrower than I would prefer. I haven&rsquo;t been able to figure out how to add some width yet, but I suspect it&rsquo;s possible with the right CSS bits.</p>\n<p>I&rsquo;ve deleted all the other browsers from my laptop (except Safari) and I&rsquo;m using Vivaldi full time now. So far so good.</p>\n",
				"content_text": "I was a devoted Firefox user for many years but recently, the list of annoyances with Firefox started to pile up.\n\nSome of this is self-inflicted like the Proton redesign that changed the UI for the tabs in what I thought was a step backwards. Google also started to purposefully break things on Firefox including stuff like background blur on Meet calls and fullscreen viewing in YouTube.\n\nI switched to Brave for a year or so and enjoyed that browser quite a bit. It's Chromium underneath meaning that it shares the open source core that Chrome is built upon. Extension support is excellent and the look and feel is nice.\n\nBut Brave comes with a weird crypto play called Brave Rewards built around the Basic Attention Token (BAT) which is a cryptocurrency coin. You can disable all that stuff, but it's not something I think belongs in a browser.\n\nThat left me looking for something new. I tried Safari but the lack of good extensions (especially for ad blocking) made that a non-starter. Orion is a new browser that looks a lot like Safari but adds Chrome/Firefox extension support. It's in beta and it shows -- it's far too buggy to be an everyday browser.\n\nMicrosoft offers Edge that is also built around Chromium, but like Brave, they layer on a whole load of unwanted stuff. In the case of Edge, there's shopping and other crapware built in that I don't want.\n\nWhat's left? Vivaldi.\n\nI've resisted Vivaldi a bit over the years because I don't like the look and feel of it. I find the tabs and icons to be a bit weird looking, especially on the Mac. But I thought I would give it another go, partly because I like the direction things are going with Vivaldi but also because I learned that the UI is quite customizable.\n\nVivaldi's UI is built using HTML and CSS meaning you can tweak things to your liking (to a certain extent). I'm not doing a whole lot, but I added a bit of padding on the left side of the bookmarks bar and bumped up the font size a half a pixel to make it look just a bit better to my eye.\n\nOne thing I still don't like is that the tabs in Vivaldi are a touch narrower than I would prefer. I haven't been able to figure out how to add some width yet, but I suspect it's possible with the right CSS bits.\n\nI've deleted all the other browsers from my laptop (except Safari) and I'm using Vivaldi full time now. So far so good.\n",
				"date_published": "2022-12-11T16:26:49-04:00",
				"url": "https://www.jameskoole.com/2022/12/11/vivaldi-browser.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/12/04/uses-for-a.html",
				"title": "Uses for a Synology",
				"content_html": "<p>I got my hands on a <a href=\"https://www.synology.com/en-ca\">Synology DS920+</a> a couple of years ago. It has two <a href=\"https://www.seagate.com/ca/en/products/nas-drives/ironwolf-hard-drive/\">Seagate Ironwolf 4TB</a> drives in it meaning I have a few TB of backup space sitting on my desk in the basement. But besides backing up your files, photos or computers, what else is a Synology good for?</p>\n<ul>\n<li><strong>Plex Server</strong> - I run a <a href=\"https://www.plex.tv/\">Plex home media server</a> on my Synology along with Sonarr and Deluge (in Docker to pull down shows automatically). I generally use this to run a home PVR, downloading mostly stuff I could already get with my cable package. The downloads are nice though because there are no commercials.</li>\n<li><strong>Homebridge</strong> - I also have a <a href=\"https://homebridge.io/\">Homebridge</a> server running that bridges my non-HomeKit smart home devices over to the HomeKit world. You can read more about my Homebridge and HomeKit setup if you want.</li>\n<li><strong>OpenVPN</strong> - one of the best uses for a home server is running your own VPN. With <a href=\"https://openvpn.net/community-downloads/\">OpenVPN</a>, I can connect back to my home network (and internet connection) from virtually anywhere in the world. That means secure connections on public wifi and also access to shows and services like Bell Fibe TV from outside Canada since the data actually flows through my home internet IP.</li>\n<li><strong>Photo backup</strong> - I have my entire Lightroom library of photos backed up to my Synology in addition to being in Adobe Creative Cloud. It gives me some peace of mind in case something were to go badly with the cloud service.</li>\n</ul>\n<p>Some other uses for a Synology include acting as a Apple Time Machine backup destination. Since the Synology is networked, it can be a great solution for providing storage for multiple computers in the household.</p>\n<p>It&rsquo;s also possible to run your own Dropbox-type solution via apps like <a href=\"https://owncloud.com/\">OwnCloud</a>. You can even host a WordPress blog and your own email server if that&rsquo;s your thing.</p>\n",
				"content_text": "I got my hands on a [Synology DS920+](https://www.synology.com/en-ca) a couple of years ago. It has two [Seagate Ironwolf 4TB](https://www.seagate.com/ca/en/products/nas-drives/ironwolf-hard-drive/) drives in it meaning I have a few TB of backup space sitting on my desk in the basement. But besides backing up your files, photos or computers, what else is a Synology good for?\n\n* **Plex Server** - I run a [Plex home media server](https://www.plex.tv/) on my Synology along with Sonarr and Deluge (in Docker to pull down shows automatically). I generally use this to run a home PVR, downloading mostly stuff I could already get with my cable package. The downloads are nice though because there are no commercials.\n* **Homebridge** - I also have a [Homebridge](https://homebridge.io/) server running that bridges my non-HomeKit smart home devices over to the HomeKit world. You can read more about my Homebridge and HomeKit setup if you want.\n* **OpenVPN** - one of the best uses for a home server is running your own VPN. With [OpenVPN](https://openvpn.net/community-downloads/), I can connect back to my home network (and internet connection) from virtually anywhere in the world. That means secure connections on public wifi and also access to shows and services like Bell Fibe TV from outside Canada since the data actually flows through my home internet IP.\n* **Photo backup** - I have my entire Lightroom library of photos backed up to my Synology in addition to being in Adobe Creative Cloud. It gives me some peace of mind in case something were to go badly with the cloud service.\n\nSome other uses for a Synology include acting as a Apple Time Machine backup destination. Since the Synology is networked, it can be a great solution for providing storage for multiple computers in the household.\n\nIt's also possible to run your own Dropbox-type solution via apps like [OwnCloud](https://owncloud.com/). You can even host a WordPress blog and your own email server if that's your thing.\n",
				"date_published": "2022-12-04T18:15:20-04:00",
				"url": "https://www.jameskoole.com/2022/12/04/uses-for-a.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/11/27/twitter-for-news.html",
				"title": "Twitter for News and Information",
				"content_html": "<p>Do I miss Twitter? Not really.</p>\n<p>There are a few things that bring me back occasionally to do a search. Mostly it&rsquo;s real-time news or information, including breaking news events like earthquakes or plane crashes. It&rsquo;s also things like updates from our transit service on diversions and closures.</p>\n<p>Over time as more and more people join Mastodon, there will invariably be more of that kind of information away from Twitter as well. A bot sort of provides re-posts of the transit information in Toronto, but it&rsquo;s not all that reliable. I might just create my own with a combination of the various services I want all in a single Mastodon account.</p>\n<p>When Twitter started, it didn&rsquo;t have all this stuff either and it took a long time before it became the place the world went for information and news. Mastodon will get there eventually.</p>\n",
				"content_text": "Do I miss Twitter? Not really.\n\nThere are a few things that bring me back occasionally to do a search. Mostly it's real-time news or information, including breaking news events like earthquakes or plane crashes. It's also things like updates from our transit service on diversions and closures.\n\nOver time as more and more people join Mastodon, there will invariably be more of that kind of information away from Twitter as well. A bot sort of provides re-posts of the transit information in Toronto, but it's not all that reliable. I might just create my own with a combination of the various services I want all in a single Mastodon account.\n\nWhen Twitter started, it didn't have all this stuff either and it took a long time before it became the place the world went for information and news. Mastodon will get there eventually.\n",
				"date_published": "2022-11-27T20:16:13-04:00",
				"url": "https://www.jameskoole.com/2022/11/27/twitter-for-news.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/11/26/wading-into-homekit.html",
				"title": "Wading into HomeKit",
				"content_html": "<p><img src=\"https://cdn.uploads.micro.blog/65363/2023/918cef3619.jpg\" alt=\"\"></p>\n<p>I&rsquo;ve had a few &ldquo;smart&rdquo; devices around the house, but generally they all used Amazon Alexa for control and not Apple&rsquo;s HomeKit. But with the recent updates to HomeKit (coming in iOS 16.2) and the news that Amazon is losing mega money on Alexa, I decided to give HomeKit a try.</p>\n<p>I don&rsquo;t have the most complicated setup:</p>\n<ol>\n<li>Logitech Circle 2 camera - front porch.</li>\n<li>Wyze Cam v2 camera - floats around as needed.</li>\n<li>Wyze plugs (2) - desk lamp and other things as needed.</li>\n<li>Wemo plug - fan.</li>\n<li>TP-Link outdoor two outlet plug - Christmas lights.</li>\n<li>Wyze Colour bulbs (6) - basement lights, front porch light.</li>\n<li>Ecobee - smart thermostat.</li>\n</ol>\n<p>Three of those devices have HomeKit support built in - the Logitech Circle 2, the Wemo plug and the Ecobee. Adding them to HomeKit was a snap. The rest doesn&rsquo;t have HomeKit support so that meant I needed a solution for all the Wyze gear and the TP-Link plug.</p>\n<h3 id=\"homebridge\">Homebridge</h3>\n<p>That solution was <a href=\"https://homebridge.io/\">Homebridge</a> which is a server application that builds bridges between non-HomeKit devices and HomeKit. It runs on a server like a Raspberry Pi, or a Mac mini. In my case, it&rsquo;s running on my <a href=\"https://www.synology.com/en-ca/products\">Synology</a> DS920+ NAS.</p>\n<p>Set up was a little complicated, but not ridiculously so. Homebridge was easy to setup and get added into HomeKit. Once that was done, it was a matter of adding the plugins to Homebridge that I needed for my specific devices.</p>\n<p>I used <a href=\"https://github.com/jfarmer08/homebridge-wyze-smart-home\">Homebridge Wyze Smart Home</a> and <a href=\"https://github.com/plasticrake/homebridge-tplink-smarthome#readme\">TP-Link Smart Home</a>. That took care of the bulbs and plugs plus the outdoor dual plug. That left just the Wyze Cam v2 which needed a different plugin. I used <a href=\"https://github.com/Sunoo/homebridge-camera-ffmpeg#readme\">Homebridge Camera FFmpeg</a> for that which required the Wyze Cam v2 to have the RTSP firmware (which I had already installed on mine).</p>\n<h3 id=\"homekit-hub\">HomeKit Hub</h3>\n<p>HomeKit also requires a Hub for all this to work. That hub can be either a HomePod mini or an AppleTV. I opted to get a new <a href=\"https://www.apple.com/apple-tv-4k/\">AppleTV 4K</a> as I only had an older 3rd generation AppleTV around and it doesn&rsquo;t offer full support for HomeKit.</p>\n<p>Everything is all set up now and I can see my two cameras in the Home app. Plus everything is controllable via the app, by talking to Siri and also using HomeKit automations. That last part is really exciting to me as I&rsquo;ll be able to do things like have lights turn off and on as people leave and arrive back home.</p>\n<p>I&rsquo;ll probably swap out the Wyze stuff over time for Philips Hue or something else. But until then, Homebridge does a great job bridging the non-HomeKit devices and the HomeKit world.</p>\n",
				"content_text": "![](https://cdn.uploads.micro.blog/65363/2023/918cef3619.jpg)\n\nI've had a few \"smart\" devices around the house, but generally they all used Amazon Alexa for control and not Apple's HomeKit. But with the recent updates to HomeKit (coming in iOS 16.2) and the news that Amazon is losing mega money on Alexa, I decided to give HomeKit a try.\n\nI don't have the most complicated setup:\n\n1.  Logitech Circle 2 camera - front porch.\n2.  Wyze Cam v2 camera - floats around as needed.\n3.  Wyze plugs (2) - desk lamp and other things as needed.\n4.  Wemo plug - fan.\n5.  TP-Link outdoor two outlet plug - Christmas lights.\n6.  Wyze Colour bulbs (6) - basement lights, front porch light.\n7.  Ecobee - smart thermostat.\n\nThree of those devices have HomeKit support built in - the Logitech Circle 2, the Wemo plug and the Ecobee. Adding them to HomeKit was a snap. The rest doesn't have HomeKit support so that meant I needed a solution for all the Wyze gear and the TP-Link plug.\n\n### Homebridge\n\nThat solution was [Homebridge](https://homebridge.io/) which is a server application that builds bridges between non-HomeKit devices and HomeKit. It runs on a server like a Raspberry Pi, or a Mac mini. In my case, it's running on my [Synology](https://www.synology.com/en-ca/products) DS920+ NAS.\n\nSet up was a little complicated, but not ridiculously so. Homebridge was easy to setup and get added into HomeKit. Once that was done, it was a matter of adding the plugins to Homebridge that I needed for my specific devices.\n\nI used [Homebridge Wyze Smart Home](https://github.com/jfarmer08/homebridge-wyze-smart-home) and [TP-Link Smart Home](https://github.com/plasticrake/homebridge-tplink-smarthome#readme). That took care of the bulbs and plugs plus the outdoor dual plug. That left just the Wyze Cam v2 which needed a different plugin. I used [Homebridge Camera FFmpeg](https://github.com/Sunoo/homebridge-camera-ffmpeg#readme) for that which required the Wyze Cam v2 to have the RTSP firmware (which I had already installed on mine).\n\n### HomeKit Hub\n\nHomeKit also requires a Hub for all this to work. That hub can be either a HomePod mini or an AppleTV. I opted to get a new [AppleTV 4K](https://www.apple.com/apple-tv-4k/) as I only had an older 3rd generation AppleTV around and it doesn't offer full support for HomeKit.\n\nEverything is all set up now and I can see my two cameras in the Home app. Plus everything is controllable via the app, by talking to Siri and also using HomeKit automations. That last part is really exciting to me as I'll be able to do things like have lights turn off and on as people leave and arrive back home.\n\nI'll probably swap out the Wyze stuff over time for Philips Hue or something else. But until then, Homebridge does a great job bridging the non-HomeKit devices and the HomeKit world.\n",
				"date_published": "2022-11-26T19:30:26-04:00",
				"url": "https://www.jameskoole.com/2022/11/26/wading-into-homekit.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/11/25/some-mastodon-tips.html",
				"title": "Some Mastodon Tips",
				"content_html": "<p>I&rsquo;ve been full-time on Mastodon for a week or three now and don&rsquo;t really use Twitter anymore. I check there every now and then, but I don&rsquo;t follow anyone or post there.</p>\n<p>In my time on Mastodon, I&rsquo;ve noticed some things that are very similar to Twitter, but also a few things that are a little bit different. Here&rsquo;s a few notes if you are just wading in.</p>\n<ul>\n<li>If you are on an instance that is not &ldquo;general&rdquo; and aligns with your interests, then the Local Timeline is worthwhile to look at. You can find new people to follow or at least see everything that is posted across your entire instance. If you are on a huge instance like mastodon.social, it&rsquo;s not as great.</li>\n<li>The Federated Timeline is a little bit bananas. If you were on Twitter back in 2006-2007, then you might remember that you used to be able to just watch literally ALL the tweets go by. The Federated Timeline is like that and it&rsquo;s exactly what you would imagine.</li>\n<li>DMs are different than on Twitter. If you have a DM conversation going between you and someone else, and then you mention a third person, they get pulled into that chat and can see the previous messages in the conversation. So be careful with that.</li>\n<li>Posts (sometimes called Toots) have different options between public and private. You can post public posts, unlisted (like public, but they don&rsquo;t show up in searches), followers only and @mentioned only.</li>\n<li>Hashtags really matter on Mastodon. Search is generally best with hashtags so if you want your posts to be found, sprinkle a few #hashtags through your #posts and enjoy some increased #engagement.</li>\n</ul>\n<p>I&rsquo;ve noticed significantly more conversation happening on Mastodon. I&rsquo;m pretty sure that the majority of Twitter users don&rsquo;t read or even see a lot of the tweets of the people they follow thanks to the algorithmic view that Twitter forces on users.</p>\n<p>It&rsquo;s also clear to me that a high percentage of Twitter followers aren&rsquo;t even there anymore. You might have 200 followers, but 100 of them no longer use Twitter, and when you Tweet, perhaps ten of your followers actually see what you posted.</p>\n<p>On Mastodon, it&rsquo;s far more likely that a higher percentage of your followers are actually using the service and will also actually see your posts.</p>\n",
				"content_text": "I've been full-time on Mastodon for a week or three now and don't really use Twitter anymore. I check there every now and then, but I don't follow anyone or post there.\n\nIn my time on Mastodon, I've noticed some things that are very similar to Twitter, but also a few things that are a little bit different. Here's a few notes if you are just wading in.\n\n* If you are on an instance that is not \"general\" and aligns with your interests, then the Local Timeline is worthwhile to look at. You can find new people to follow or at least see everything that is posted across your entire instance. If you are on a huge instance like mastodon.social, it's not as great.\n* The Federated Timeline is a little bit bananas. If you were on Twitter back in 2006-2007, then you might remember that you used to be able to just watch literally ALL the tweets go by. The Federated Timeline is like that and it's exactly what you would imagine.\n* DMs are different than on Twitter. If you have a DM conversation going between you and someone else, and then you mention a third person, they get pulled into that chat and can see the previous messages in the conversation. So be careful with that.\n* Posts (sometimes called Toots) have different options between public and private. You can post public posts, unlisted (like public, but they don't show up in searches), followers only and @mentioned only.\n* Hashtags really matter on Mastodon. Search is generally best with hashtags so if you want your posts to be found, sprinkle a few #hashtags through your #posts and enjoy some increased #engagement.\n\nI've noticed significantly more conversation happening on Mastodon. I'm pretty sure that the majority of Twitter users don't read or even see a lot of the tweets of the people they follow thanks to the algorithmic view that Twitter forces on users.\n\nIt's also clear to me that a high percentage of Twitter followers aren't even there anymore. You might have 200 followers, but 100 of them no longer use Twitter, and when you Tweet, perhaps ten of your followers actually see what you posted.\n\nOn Mastodon, it's far more likely that a higher percentage of your followers are actually using the service and will also actually see your posts.\n",
				"date_published": "2022-11-25T20:32:30-04:00",
				"url": "https://www.jameskoole.com/2022/11/25/some-mastodon-tips.html",
				"tags": ["Open Web"]
			},
			{
				"id": "http://jameskoole.micro.blog/2022/11/19/does-mastodon-need.html",
				"title": "Does Mastodon Need Twitter to Die to Succeed?",
				"content_html": "<p>Is Twitter dying? I don’t think it matters anymore. Mastodon is growing and people are discovering that there is an alternative social network to the bird site owned by the egomaniac billionaire.</p>\n<p>I believe Mastodon has nearly reached a critical mass or inflection point where it can go from fringe alternative for geeks and nerds and will become something that anyone can, and will use.</p>\n<p>The average person has now at least <em>heard</em> of Mastodon. They know it’s a Twitter-like service. They’ve heard of the fediverse and at least have a sense of how Mastodon is different from the centralized Twitter service. It’s all over the mainstream press and not just the tech blogs.</p>\n<p>A few things could happen in the next little bit that would have significant impacts on Twitter and Mastodon.</p>\n<ol>\n<li>The World Cup or another event brings back the fail whale – historically, large sporting events like the World Cup have put signficant strain on Twitter. Between the recent layoffs, firings and resignations, it’s possible that a significant event might lead to downtime. If Twitter goes down, there will be further and significant influx of users to Mastodon.</li>\n<li>Trump reinstated – Elon Musk could reinstate the account of Donald Trump. If Trump returns to Twitter, it may very well be “a last straw” for some users. Until recently, there wasn’t a viable option for them, but Mastodon is growing quickly and many of these users who quit Twitter will head to Mastodon. <em>UPDATE: Trump was reinstated not long after I posted this.</em></li>\n<li>Brands and celebrities join – a few brands have waded into Mastodon, and if Twitter continues to implode, more will follow. Similarly, some of the “nerd” celebrities have joined or moved to Mastodon. Mainstream celebrities will naturally follow if they see the platform grow.</li>\n<li>The media joins – Twitter is widely seen as a place to get realtime news and information. Right now Mastodon is not there yet, although as more users join, more info, videos and photos about significant events like storms, accidents, etc. will show up on Mastodon. If journalists and media outlets start to join, this will have a big impact on what kind of content can be found on Mastodon.</li>\n<li>Bots – there are a ton of bots on Twitter sharing weather warnings, earthquakes, news, quotes, and fun stuff. Mastodon welcomes bots and makes it easy for users to create them. There are already bots on Mastodon, but not the breadth of what’s available on Twitter.</li>\n<li>Apps and sites integrate Mastodon features – so many apps and websites have things like “Share to Twitter” built in. If Mastodon gets enough users, app makers and website owners will add “Share to Mastodon” making it far easier for users to quickly share content.</li>\n</ol>\n<p>Mastodon has very little control over these things. But <em>users</em> of Mastodon can have a big impact on adoption.</p>\n<p>We can quit Twitter and make a point of saying why we’re leaving and that we are going to Mastodon. We can push brands and celebrities to make the switch through tweets and encouragement. We can do the same for media outlets and journalists by suggesting they at least join Mastodon and cross-post. We can build bots to bring news, weather, alerts and other information to Mastodon. We can push app makers to add “Share to Mastodon” buttons and suggest to websites that they do likewise and we can add that functionality to our own sites.</p>\n<p>This is the best chance we have to bring the fediverse and Mastodon into the mainstream. It’s not going to be a single event that does it, but a series of events that are used to build momentum that will take it to critical mass. Once we get there, it’ll be unstoppable.</p>\n",
				"content_text": "Is Twitter dying? I don’t think it matters anymore. Mastodon is growing and people are discovering that there is an alternative social network to the bird site owned by the egomaniac billionaire.\n\nI believe Mastodon has nearly reached a critical mass or inflection point where it can go from fringe alternative for geeks and nerds and will become something that anyone can, and will use.\n\nThe average person has now at least _heard_ of Mastodon. They know it’s a Twitter-like service. They’ve heard of the fediverse and at least have a sense of how Mastodon is different from the centralized Twitter service. It’s all over the mainstream press and not just the tech blogs.\n\nA few things could happen in the next little bit that would have significant impacts on Twitter and Mastodon.\n\n1. The World Cup or another event brings back the fail whale – historically, large sporting events like the World Cup have put signficant strain on Twitter. Between the recent layoffs, firings and resignations, it’s possible that a significant event might lead to downtime. If Twitter goes down, there will be further and significant influx of users to Mastodon.\n2. Trump reinstated – Elon Musk could reinstate the account of Donald Trump. If Trump returns to Twitter, it may very well be “a last straw” for some users. Until recently, there wasn’t a viable option for them, but Mastodon is growing quickly and many of these users who quit Twitter will head to Mastodon. _UPDATE: Trump was reinstated not long after I posted this._\n3. Brands and celebrities join – a few brands have waded into Mastodon, and if Twitter continues to implode, more will follow. Similarly, some of the “nerd” celebrities have joined or moved to Mastodon. Mainstream celebrities will naturally follow if they see the platform grow.\n4. The media joins – Twitter is widely seen as a place to get realtime news and information. Right now Mastodon is not there yet, although as more users join, more info, videos and photos about significant events like storms, accidents, etc. will show up on Mastodon. If journalists and media outlets start to join, this will have a big impact on what kind of content can be found on Mastodon.\n5. Bots – there are a ton of bots on Twitter sharing weather warnings, earthquakes, news, quotes, and fun stuff. Mastodon welcomes bots and makes it easy for users to create them. There are already bots on Mastodon, but not the breadth of what’s available on Twitter.\n6. Apps and sites integrate Mastodon features – so many apps and websites have things like “Share to Twitter” built in. If Mastodon gets enough users, app makers and website owners will add “Share to Mastodon” making it far easier for users to quickly share content.\n\nMastodon has very little control over these things. But _users_ of Mastodon can have a big impact on adoption.\n\nWe can quit Twitter and make a point of saying why we’re leaving and that we are going to Mastodon. We can push brands and celebrities to make the switch through tweets and encouragement. We can do the same for media outlets and journalists by suggesting they at least join Mastodon and cross-post. We can build bots to bring news, weather, alerts and other information to Mastodon. We can push app makers to add “Share to Mastodon” buttons and suggest to websites that they do likewise and we can add that functionality to our own sites.\n\nThis is the best chance we have to bring the fediverse and Mastodon into the mainstream. It’s not going to be a single event that does it, but a series of events that are used to build momentum that will take it to critical mass. Once we get there, it’ll be unstoppable.\n",
				"date_published": "2022-11-19T11:49:41-04:00",
				"url": "https://www.jameskoole.com/2022/11/19/does-mastodon-need.html",
				"tags": ["Open Web"]
			}
	]
}
